-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Tempo de geração: 18/09/2026 às 20:01
-- Versão do servidor: 10.4.32-MariaDB
-- Versão do PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Banco de dados: `app_scholar`
--

-- --------------------------------------------------------

--
-- Estrutura para tabela `alunos`
--

CREATE TABLE `alunos` (
  `id_aluno` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `data_nascimento` date NOT NULL,
  `cpf` char(11) NOT NULL,
  `telefone` varchar(20) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `endereco` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `alunos`
--

INSERT INTO `alunos` (`id_aluno`, `nome`, `data_nascimento`, `cpf`, `telefone`, `email`, `endereco`) VALUES
(1, 'Aluno 1', '2005-01-01', '00000003001', '(12) 93000-0001', 'aluno1@email.com', 'Rua dos Alunos, 1'),
(2, 'Aluno 2', '2006-02-02', '00000003002', '(12) 93000-0002', 'aluno2@email.com', 'Rua dos Alunos, 2'),
(3, 'Aluno 3', '2007-03-03', '00000003003', '(12) 93000-0003', 'aluno3@email.com', 'Rua dos Alunos, 3'),
(4, 'Aluno 4', '2008-04-04', '00000003004', '(12) 93000-0004', 'aluno4@email.com', 'Rua dos Alunos, 4'),
(5, 'Aluno 5', '2009-05-05', '00000003005', '(12) 93000-0005', 'aluno5@email.com', 'Rua dos Alunos, 5'),
(6, 'Aluno 6', '2005-06-06', '00000003006', '(12) 93000-0006', 'aluno6@email.com', 'Rua dos Alunos, 6'),
(7, 'Aluno 7', '2006-07-07', '00000003007', '(12) 93000-0007', 'aluno7@email.com', 'Rua dos Alunos, 7'),
(8, 'Aluno 8', '2007-08-08', '00000003008', '(12) 93000-0008', 'aluno8@email.com', 'Rua dos Alunos, 8'),
(9, 'Aluno 9', '2008-09-09', '00000003009', '(12) 93000-0009', 'aluno9@email.com', 'Rua dos Alunos, 9'),
(10, 'Aluno 10', '2009-10-10', '00000003010', '(12) 93000-0010', 'aluno10@email.com', 'Rua dos Alunos, 10'),
(11, 'Aluno 11', '2005-11-11', '00000003011', '(12) 93000-0011', 'aluno11@email.com', 'Rua dos Alunos, 11'),
(12, 'Aluno 12', '2006-12-12', '00000003012', '(12) 93000-0012', 'aluno12@email.com', 'Rua dos Alunos, 12'),
(13, 'Aluno 13', '2007-01-13', '00000003013', '(12) 93000-0013', 'aluno13@email.com', 'Rua dos Alunos, 13'),
(14, 'Aluno 14', '2008-02-14', '00000003014', '(12) 93000-0014', 'aluno14@email.com', 'Rua dos Alunos, 14'),
(15, 'Aluno 15', '2009-03-15', '00000003015', '(12) 93000-0015', 'aluno15@email.com', 'Rua dos Alunos, 15'),
(16, 'Aluno 16', '2005-04-16', '00000003016', '(12) 93000-0016', 'aluno16@email.com', 'Rua dos Alunos, 16'),
(17, 'Aluno 17', '2006-05-17', '00000003017', '(12) 93000-0017', 'aluno17@email.com', 'Rua dos Alunos, 17'),
(18, 'Aluno 18', '2007-06-18', '00000003018', '(12) 93000-0018', 'aluno18@email.com', 'Rua dos Alunos, 18'),
(19, 'Aluno 19', '2008-07-19', '00000003019', '(12) 93000-0019', 'aluno19@email.com', 'Rua dos Alunos, 19'),
(20, 'Aluno 20', '2009-08-20', '00000003020', '(12) 93000-0020', 'aluno20@email.com', 'Rua dos Alunos, 20'),
(21, 'Aluno 21', '2005-09-21', '00000003021', '(12) 93000-0021', 'aluno21@email.com', 'Rua dos Alunos, 21'),
(22, 'Aluno 22', '2006-10-22', '00000003022', '(12) 93000-0022', 'aluno22@email.com', 'Rua dos Alunos, 22'),
(23, 'Aluno 23', '2007-11-23', '00000003023', '(12) 93000-0023', 'aluno23@email.com', 'Rua dos Alunos, 23'),
(24, 'Aluno 24', '2008-12-24', '00000003024', '(12) 93000-0024', 'aluno24@email.com', 'Rua dos Alunos, 24'),
(25, 'Aluno 25', '2009-01-25', '00000003025', '(12) 93000-0025', 'aluno25@email.com', 'Rua dos Alunos, 25'),
(26, 'Aluno 26', '2005-02-26', '00000003026', '(12) 93000-0026', 'aluno26@email.com', 'Rua dos Alunos, 26'),
(27, 'Aluno 27', '2006-03-27', '00000003027', '(12) 93000-0027', 'aluno27@email.com', 'Rua dos Alunos, 27'),
(28, 'Aluno 28', '2007-04-01', '00000003028', '(12) 93000-0028', 'aluno28@email.com', 'Rua dos Alunos, 28'),
(29, 'Aluno 29', '2008-05-02', '00000003029', '(12) 93000-0029', 'aluno29@email.com', 'Rua dos Alunos, 29'),
(30, 'Aluno 30', '2009-06-03', '00000003030', '(12) 93000-0030', 'aluno30@email.com', 'Rua dos Alunos, 30'),
(31, 'Aluno 31', '2005-07-04', '00000003031', '(12) 93000-0031', 'aluno31@email.com', 'Rua dos Alunos, 31'),
(32, 'Aluno 32', '2006-08-05', '00000003032', '(12) 93000-0032', 'aluno32@email.com', 'Rua dos Alunos, 32'),
(33, 'Aluno 33', '2007-09-06', '00000003033', '(12) 93000-0033', 'aluno33@email.com', 'Rua dos Alunos, 33'),
(34, 'Aluno 34', '2008-10-07', '00000003034', '(12) 93000-0034', 'aluno34@email.com', 'Rua dos Alunos, 34'),
(35, 'Aluno 35', '2009-11-08', '00000003035', '(12) 93000-0035', 'aluno35@email.com', 'Rua dos Alunos, 35'),
(36, 'Aluno 36', '2005-12-09', '00000003036', '(12) 93000-0036', 'aluno36@email.com', 'Rua dos Alunos, 36'),
(37, 'Aluno 37', '2006-01-10', '00000003037', '(12) 93000-0037', 'aluno37@email.com', 'Rua dos Alunos, 37'),
(38, 'Aluno 38', '2007-02-11', '00000003038', '(12) 93000-0038', 'aluno38@email.com', 'Rua dos Alunos, 38'),
(39, 'Aluno 39', '2008-03-12', '00000003039', '(12) 93000-0039', 'aluno39@email.com', 'Rua dos Alunos, 39'),
(40, 'Aluno 40', '2009-04-13', '00000003040', '(12) 93000-0040', 'aluno40@email.com', 'Rua dos Alunos, 40'),
(41, 'Aluno 41', '2005-05-14', '00000003041', '(12) 93000-0041', 'aluno41@email.com', 'Rua dos Alunos, 41'),
(42, 'Aluno 42', '2006-06-15', '00000003042', '(12) 93000-0042', 'aluno42@email.com', 'Rua dos Alunos, 42'),
(43, 'Aluno 43', '2007-07-16', '00000003043', '(12) 93000-0043', 'aluno43@email.com', 'Rua dos Alunos, 43'),
(44, 'Aluno 44', '2008-08-17', '00000003044', '(12) 93000-0044', 'aluno44@email.com', 'Rua dos Alunos, 44'),
(45, 'Aluno 45', '2009-09-18', '00000003045', '(12) 93000-0045', 'aluno45@email.com', 'Rua dos Alunos, 45'),
(46, 'Aluno 46', '2005-10-19', '00000003046', '(12) 93000-0046', 'aluno46@email.com', 'Rua dos Alunos, 46'),
(47, 'Aluno 47', '2006-11-20', '00000003047', '(12) 93000-0047', 'aluno47@email.com', 'Rua dos Alunos, 47'),
(48, 'Aluno 48', '2007-12-21', '00000003048', '(12) 93000-0048', 'aluno48@email.com', 'Rua dos Alunos, 48'),
(49, 'Aluno 49', '2008-01-22', '00000003049', '(12) 93000-0049', 'aluno49@email.com', 'Rua dos Alunos, 49'),
(50, 'Aluno 50', '2009-02-23', '00000003050', '(12) 93000-0050', 'aluno50@email.com', 'Rua dos Alunos, 50'),
(51, 'Aluno 51', '2005-03-24', '00000003051', '(12) 93000-0051', 'aluno51@email.com', 'Rua dos Alunos, 51'),
(52, 'Aluno 52', '2006-04-25', '00000003052', '(12) 93000-0052', 'aluno52@email.com', 'Rua dos Alunos, 52'),
(53, 'Aluno 53', '2007-05-26', '00000003053', '(12) 93000-0053', 'aluno53@email.com', 'Rua dos Alunos, 53'),
(54, 'Aluno 54', '2008-06-27', '00000003054', '(12) 93000-0054', 'aluno54@email.com', 'Rua dos Alunos, 54'),
(55, 'Aluno 55', '2009-07-01', '00000003055', '(12) 93000-0055', 'aluno55@email.com', 'Rua dos Alunos, 55'),
(56, 'Aluno 56', '2005-08-02', '00000003056', '(12) 93000-0056', 'aluno56@email.com', 'Rua dos Alunos, 56'),
(57, 'Aluno 57', '2006-09-03', '00000003057', '(12) 93000-0057', 'aluno57@email.com', 'Rua dos Alunos, 57'),
(58, 'Aluno 58', '2007-10-04', '00000003058', '(12) 93000-0058', 'aluno58@email.com', 'Rua dos Alunos, 58'),
(59, 'Aluno 59', '2008-11-05', '00000003059', '(12) 93000-0059', 'aluno59@email.com', 'Rua dos Alunos, 59'),
(60, 'Aluno 60', '2009-12-06', '00000003060', '(12) 93000-0060', 'aluno60@email.com', 'Rua dos Alunos, 60'),
(61, 'Aluno 61', '2005-01-07', '00000003061', '(12) 93000-0061', 'aluno61@email.com', 'Rua dos Alunos, 61'),
(62, 'Aluno 62', '2006-02-08', '00000003062', '(12) 93000-0062', 'aluno62@email.com', 'Rua dos Alunos, 62'),
(63, 'Aluno 63', '2007-03-09', '00000003063', '(12) 93000-0063', 'aluno63@email.com', 'Rua dos Alunos, 63'),
(64, 'Aluno 64', '2008-04-10', '00000003064', '(12) 93000-0064', 'aluno64@email.com', 'Rua dos Alunos, 64'),
(65, 'Aluno 65', '2009-05-11', '00000003065', '(12) 93000-0065', 'aluno65@email.com', 'Rua dos Alunos, 65'),
(66, 'Aluno 66', '2005-06-12', '00000003066', '(12) 93000-0066', 'aluno66@email.com', 'Rua dos Alunos, 66'),
(67, 'Aluno 67', '2006-07-13', '00000003067', '(12) 93000-0067', 'aluno67@email.com', 'Rua dos Alunos, 67'),
(68, 'Aluno 68', '2007-08-14', '00000003068', '(12) 93000-0068', 'aluno68@email.com', 'Rua dos Alunos, 68'),
(69, 'Aluno 69', '2008-09-15', '00000003069', '(12) 93000-0069', 'aluno69@email.com', 'Rua dos Alunos, 69'),
(70, 'Aluno 70', '2009-10-16', '00000003070', '(12) 93000-0070', 'aluno70@email.com', 'Rua dos Alunos, 70'),
(71, 'Aluno 71', '2005-11-17', '00000003071', '(12) 93000-0071', 'aluno71@email.com', 'Rua dos Alunos, 71'),
(72, 'Aluno 72', '2006-12-18', '00000003072', '(12) 93000-0072', 'aluno72@email.com', 'Rua dos Alunos, 72'),
(73, 'Aluno 73', '2007-01-19', '00000003073', '(12) 93000-0073', 'aluno73@email.com', 'Rua dos Alunos, 73'),
(74, 'Aluno 74', '2008-02-20', '00000003074', '(12) 93000-0074', 'aluno74@email.com', 'Rua dos Alunos, 74'),
(75, 'Aluno 75', '2009-03-21', '00000003075', '(12) 93000-0075', 'aluno75@email.com', 'Rua dos Alunos, 75'),
(76, 'Aluno 76', '2005-04-22', '00000003076', '(12) 93000-0076', 'aluno76@email.com', 'Rua dos Alunos, 76'),
(77, 'Aluno 77', '2006-05-23', '00000003077', '(12) 93000-0077', 'aluno77@email.com', 'Rua dos Alunos, 77'),
(78, 'Aluno 78', '2007-06-24', '00000003078', '(12) 93000-0078', 'aluno78@email.com', 'Rua dos Alunos, 78'),
(79, 'Aluno 79', '2008-07-25', '00000003079', '(12) 93000-0079', 'aluno79@email.com', 'Rua dos Alunos, 79'),
(80, 'Aluno 80', '2009-08-26', '00000003080', '(12) 93000-0080', 'aluno80@email.com', 'Rua dos Alunos, 80'),
(81, 'Aluno 81', '2005-09-27', '00000003081', '(12) 93000-0081', 'aluno81@email.com', 'Rua dos Alunos, 81'),
(82, 'Aluno 82', '2006-10-01', '00000003082', '(12) 93000-0082', 'aluno82@email.com', 'Rua dos Alunos, 82'),
(83, 'Aluno 83', '2007-11-02', '00000003083', '(12) 93000-0083', 'aluno83@email.com', 'Rua dos Alunos, 83'),
(84, 'Aluno 84', '2008-12-03', '00000003084', '(12) 93000-0084', 'aluno84@email.com', 'Rua dos Alunos, 84'),
(85, 'Aluno 85', '2009-01-04', '00000003085', '(12) 93000-0085', 'aluno85@email.com', 'Rua dos Alunos, 85'),
(86, 'Aluno 86', '2005-02-05', '00000003086', '(12) 93000-0086', 'aluno86@email.com', 'Rua dos Alunos, 86'),
(87, 'Aluno 87', '2006-03-06', '00000003087', '(12) 93000-0087', 'aluno87@email.com', 'Rua dos Alunos, 87'),
(88, 'Aluno 88', '2007-04-07', '00000003088', '(12) 93000-0088', 'aluno88@email.com', 'Rua dos Alunos, 88'),
(89, 'Aluno 89', '2008-05-08', '00000003089', '(12) 93000-0089', 'aluno89@email.com', 'Rua dos Alunos, 89'),
(90, 'Aluno 90', '2009-06-09', '00000003090', '(12) 93000-0090', 'aluno90@email.com', 'Rua dos Alunos, 90'),
(91, 'Aluno 91', '2005-07-10', '00000003091', '(12) 93000-0091', 'aluno91@email.com', 'Rua dos Alunos, 91'),
(92, 'Aluno 92', '2006-08-11', '00000003092', '(12) 93000-0092', 'aluno92@email.com', 'Rua dos Alunos, 92'),
(93, 'Aluno 93', '2007-09-12', '00000003093', '(12) 93000-0093', 'aluno93@email.com', 'Rua dos Alunos, 93'),
(94, 'Aluno 94', '2008-10-13', '00000003094', '(12) 93000-0094', 'aluno94@email.com', 'Rua dos Alunos, 94'),
(95, 'Aluno 95', '2009-11-14', '00000003095', '(12) 93000-0095', 'aluno95@email.com', 'Rua dos Alunos, 95'),
(96, 'Aluno 96', '2005-12-15', '00000003096', '(12) 93000-0096', 'aluno96@email.com', 'Rua dos Alunos, 96'),
(97, 'Aluno 97', '2006-01-16', '00000003097', '(12) 93000-0097', 'aluno97@email.com', 'Rua dos Alunos, 97'),
(98, 'Aluno 98', '2007-02-17', '00000003098', '(12) 93000-0098', 'aluno98@email.com', 'Rua dos Alunos, 98'),
(99, 'Aluno 99', '2008-03-18', '00000003099', '(12) 93000-0099', 'aluno99@email.com', 'Rua dos Alunos, 99'),
(100, 'Aluno 100', '2009-04-19', '00000003100', '(12) 93000-0100', 'aluno100@email.com', 'Rua dos Alunos, 100'),
(101, 'Aluno 101', '2005-05-20', '00000003101', '(12) 93000-0101', 'aluno101@email.com', 'Rua dos Alunos, 101'),
(102, 'Aluno 102', '2006-06-21', '00000003102', '(12) 93000-0102', 'aluno102@email.com', 'Rua dos Alunos, 102'),
(103, 'Aluno 103', '2007-07-22', '00000003103', '(12) 93000-0103', 'aluno103@email.com', 'Rua dos Alunos, 103'),
(104, 'Aluno 104', '2008-08-23', '00000003104', '(12) 93000-0104', 'aluno104@email.com', 'Rua dos Alunos, 104'),
(105, 'Aluno 105', '2009-09-24', '00000003105', '(12) 93000-0105', 'aluno105@email.com', 'Rua dos Alunos, 105'),
(106, 'Aluno 106', '2005-10-25', '00000003106', '(12) 93000-0106', 'aluno106@email.com', 'Rua dos Alunos, 106'),
(107, 'Aluno 107', '2006-11-26', '00000003107', '(12) 93000-0107', 'aluno107@email.com', 'Rua dos Alunos, 107'),
(108, 'Aluno 108', '2007-12-27', '00000003108', '(12) 93000-0108', 'aluno108@email.com', 'Rua dos Alunos, 108'),
(109, 'Aluno 109', '2008-01-01', '00000003109', '(12) 93000-0109', 'aluno109@email.com', 'Rua dos Alunos, 109'),
(110, 'Aluno 110', '2009-02-02', '00000003110', '(12) 93000-0110', 'aluno110@email.com', 'Rua dos Alunos, 110'),
(111, 'Aluno 111', '2005-03-03', '00000003111', '(12) 93000-0111', 'aluno111@email.com', 'Rua dos Alunos, 111'),
(112, 'Aluno 112', '2006-04-04', '00000003112', '(12) 93000-0112', 'aluno112@email.com', 'Rua dos Alunos, 112'),
(113, 'Aluno 113', '2007-05-05', '00000003113', '(12) 93000-0113', 'aluno113@email.com', 'Rua dos Alunos, 113'),
(114, 'Aluno 114', '2008-06-06', '00000003114', '(12) 93000-0114', 'aluno114@email.com', 'Rua dos Alunos, 114'),
(115, 'Aluno 115', '2009-07-07', '00000003115', '(12) 93000-0115', 'aluno115@email.com', 'Rua dos Alunos, 115'),
(116, 'Aluno 116', '2005-08-08', '00000003116', '(12) 93000-0116', 'aluno116@email.com', 'Rua dos Alunos, 116'),
(117, 'Aluno 117', '2006-09-09', '00000003117', '(12) 93000-0117', 'aluno117@email.com', 'Rua dos Alunos, 117'),
(118, 'Aluno 118', '2007-10-10', '00000003118', '(12) 93000-0118', 'aluno118@email.com', 'Rua dos Alunos, 118'),
(119, 'Aluno 119', '2008-11-11', '00000003119', '(12) 93000-0119', 'aluno119@email.com', 'Rua dos Alunos, 119'),
(120, 'Aluno 120', '2009-12-12', '00000003120', '(12) 93000-0120', 'aluno120@email.com', 'Rua dos Alunos, 120'),
(121, 'Aluno 121', '2005-01-13', '00000003121', '(12) 93000-0121', 'aluno121@email.com', 'Rua dos Alunos, 121'),
(122, 'Aluno 122', '2006-02-14', '00000003122', '(12) 93000-0122', 'aluno122@email.com', 'Rua dos Alunos, 122'),
(123, 'Aluno 123', '2007-03-15', '00000003123', '(12) 93000-0123', 'aluno123@email.com', 'Rua dos Alunos, 123'),
(124, 'Aluno 124', '2008-04-16', '00000003124', '(12) 93000-0124', 'aluno124@email.com', 'Rua dos Alunos, 124'),
(125, 'Aluno 125', '2009-05-17', '00000003125', '(12) 93000-0125', 'aluno125@email.com', 'Rua dos Alunos, 125'),
(126, 'Aluno 126', '2005-06-18', '00000003126', '(12) 93000-0126', 'aluno126@email.com', 'Rua dos Alunos, 126'),
(127, 'Aluno 127', '2006-07-19', '00000003127', '(12) 93000-0127', 'aluno127@email.com', 'Rua dos Alunos, 127'),
(128, 'Aluno 128', '2007-08-20', '00000003128', '(12) 93000-0128', 'aluno128@email.com', 'Rua dos Alunos, 128'),
(129, 'Aluno 129', '2008-09-21', '00000003129', '(12) 93000-0129', 'aluno129@email.com', 'Rua dos Alunos, 129'),
(130, 'Aluno 130', '2009-10-22', '00000003130', '(12) 93000-0130', 'aluno130@email.com', 'Rua dos Alunos, 130'),
(131, 'Aluno 131', '2005-11-23', '00000003131', '(12) 93000-0131', 'aluno131@email.com', 'Rua dos Alunos, 131'),
(132, 'Aluno 132', '2006-12-24', '00000003132', '(12) 93000-0132', 'aluno132@email.com', 'Rua dos Alunos, 132'),
(133, 'Aluno 133', '2007-01-25', '00000003133', '(12) 93000-0133', 'aluno133@email.com', 'Rua dos Alunos, 133'),
(134, 'Aluno 134', '2008-02-26', '00000003134', '(12) 93000-0134', 'aluno134@email.com', 'Rua dos Alunos, 134'),
(135, 'Aluno 135', '2009-03-27', '00000003135', '(12) 93000-0135', 'aluno135@email.com', 'Rua dos Alunos, 135'),
(136, 'Aluno 136', '2005-04-01', '00000003136', '(12) 93000-0136', 'aluno136@email.com', 'Rua dos Alunos, 136'),
(137, 'Aluno 137', '2006-05-02', '00000003137', '(12) 93000-0137', 'aluno137@email.com', 'Rua dos Alunos, 137'),
(138, 'Aluno 138', '2007-06-03', '00000003138', '(12) 93000-0138', 'aluno138@email.com', 'Rua dos Alunos, 138'),
(139, 'Aluno 139', '2008-07-04', '00000003139', '(12) 93000-0139', 'aluno139@email.com', 'Rua dos Alunos, 139'),
(140, 'Aluno 140', '2009-08-05', '00000003140', '(12) 93000-0140', 'aluno140@email.com', 'Rua dos Alunos, 140'),
(141, 'Aluno 141', '2005-09-06', '00000003141', '(12) 93000-0141', 'aluno141@email.com', 'Rua dos Alunos, 141'),
(142, 'Aluno 142', '2006-10-07', '00000003142', '(12) 93000-0142', 'aluno142@email.com', 'Rua dos Alunos, 142'),
(143, 'Aluno 143', '2007-11-08', '00000003143', '(12) 93000-0143', 'aluno143@email.com', 'Rua dos Alunos, 143'),
(144, 'Aluno 144', '2008-12-09', '00000003144', '(12) 93000-0144', 'aluno144@email.com', 'Rua dos Alunos, 144'),
(145, 'Aluno 145', '2009-01-10', '00000003145', '(12) 93000-0145', 'aluno145@email.com', 'Rua dos Alunos, 145'),
(146, 'Aluno 146', '2005-02-11', '00000003146', '(12) 93000-0146', 'aluno146@email.com', 'Rua dos Alunos, 146'),
(147, 'Aluno 147', '2006-03-12', '00000003147', '(12) 93000-0147', 'aluno147@email.com', 'Rua dos Alunos, 147'),
(148, 'Aluno 148', '2007-04-13', '00000003148', '(12) 93000-0148', 'aluno148@email.com', 'Rua dos Alunos, 148'),
(149, 'Aluno 149', '2008-05-14', '00000003149', '(12) 93000-0149', 'aluno149@email.com', 'Rua dos Alunos, 149'),
(150, 'Aluno 150', '2009-06-15', '00000003150', '(12) 93000-0150', 'aluno150@email.com', 'Rua dos Alunos, 150'),
(151, 'Aluno 151', '2005-07-16', '00000003151', '(12) 93000-0151', 'aluno151@email.com', 'Rua dos Alunos, 151'),
(152, 'Aluno 152', '2006-08-17', '00000003152', '(12) 93000-0152', 'aluno152@email.com', 'Rua dos Alunos, 152'),
(153, 'Aluno 153', '2007-09-18', '00000003153', '(12) 93000-0153', 'aluno153@email.com', 'Rua dos Alunos, 153'),
(154, 'Aluno 154', '2008-10-19', '00000003154', '(12) 93000-0154', 'aluno154@email.com', 'Rua dos Alunos, 154'),
(155, 'Aluno 155', '2009-11-20', '00000003155', '(12) 93000-0155', 'aluno155@email.com', 'Rua dos Alunos, 155'),
(156, 'Aluno 156', '2005-12-21', '00000003156', '(12) 93000-0156', 'aluno156@email.com', 'Rua dos Alunos, 156'),
(157, 'Aluno 157', '2006-01-22', '00000003157', '(12) 93000-0157', 'aluno157@email.com', 'Rua dos Alunos, 157'),
(158, 'Aluno 158', '2007-02-23', '00000003158', '(12) 93000-0158', 'aluno158@email.com', 'Rua dos Alunos, 158'),
(159, 'Aluno 159', '2008-03-24', '00000003159', '(12) 93000-0159', 'aluno159@email.com', 'Rua dos Alunos, 159'),
(160, 'Aluno 160', '2009-04-25', '00000003160', '(12) 93000-0160', 'aluno160@email.com', 'Rua dos Alunos, 160'),
(161, 'Aluno 161', '2005-05-26', '00000003161', '(12) 93000-0161', 'aluno161@email.com', 'Rua dos Alunos, 161'),
(162, 'Aluno 162', '2006-06-27', '00000003162', '(12) 93000-0162', 'aluno162@email.com', 'Rua dos Alunos, 162'),
(163, 'Aluno 163', '2007-07-01', '00000003163', '(12) 93000-0163', 'aluno163@email.com', 'Rua dos Alunos, 163'),
(164, 'Aluno 164', '2008-08-02', '00000003164', '(12) 93000-0164', 'aluno164@email.com', 'Rua dos Alunos, 164'),
(165, 'Aluno 165', '2009-09-03', '00000003165', '(12) 93000-0165', 'aluno165@email.com', 'Rua dos Alunos, 165'),
(166, 'Aluno 166', '2005-10-04', '00000003166', '(12) 93000-0166', 'aluno166@email.com', 'Rua dos Alunos, 166'),
(167, 'Aluno 167', '2006-11-05', '00000003167', '(12) 93000-0167', 'aluno167@email.com', 'Rua dos Alunos, 167'),
(168, 'Aluno 168', '2007-12-06', '00000003168', '(12) 93000-0168', 'aluno168@email.com', 'Rua dos Alunos, 168'),
(169, 'Aluno 169', '2008-01-07', '00000003169', '(12) 93000-0169', 'aluno169@email.com', 'Rua dos Alunos, 169'),
(170, 'Aluno 170', '2009-02-08', '00000003170', '(12) 93000-0170', 'aluno170@email.com', 'Rua dos Alunos, 170'),
(171, 'Aluno 171', '2005-03-09', '00000003171', '(12) 93000-0171', 'aluno171@email.com', 'Rua dos Alunos, 171'),
(172, 'Aluno 172', '2006-04-10', '00000003172', '(12) 93000-0172', 'aluno172@email.com', 'Rua dos Alunos, 172'),
(173, 'Aluno 173', '2007-05-11', '00000003173', '(12) 93000-0173', 'aluno173@email.com', 'Rua dos Alunos, 173'),
(174, 'Aluno 174', '2008-06-12', '00000003174', '(12) 93000-0174', 'aluno174@email.com', 'Rua dos Alunos, 174'),
(175, 'Aluno 175', '2009-07-13', '00000003175', '(12) 93000-0175', 'aluno175@email.com', 'Rua dos Alunos, 175'),
(176, 'Aluno 176', '2005-08-14', '00000003176', '(12) 93000-0176', 'aluno176@email.com', 'Rua dos Alunos, 176'),
(177, 'Aluno 177', '2006-09-15', '00000003177', '(12) 93000-0177', 'aluno177@email.com', 'Rua dos Alunos, 177'),
(178, 'Aluno 178', '2007-10-16', '00000003178', '(12) 93000-0178', 'aluno178@email.com', 'Rua dos Alunos, 178'),
(179, 'Aluno 179', '2008-11-17', '00000003179', '(12) 93000-0179', 'aluno179@email.com', 'Rua dos Alunos, 179'),
(180, 'Aluno 180', '2009-12-18', '00000003180', '(12) 93000-0180', 'aluno180@email.com', 'Rua dos Alunos, 180'),
(181, 'Aluno 181', '2005-01-19', '00000003181', '(12) 93000-0181', 'aluno181@email.com', 'Rua dos Alunos, 181'),
(182, 'Aluno 182', '2006-02-20', '00000003182', '(12) 93000-0182', 'aluno182@email.com', 'Rua dos Alunos, 182'),
(183, 'Aluno 183', '2007-03-21', '00000003183', '(12) 93000-0183', 'aluno183@email.com', 'Rua dos Alunos, 183'),
(184, 'Aluno 184', '2008-04-22', '00000003184', '(12) 93000-0184', 'aluno184@email.com', 'Rua dos Alunos, 184'),
(185, 'Aluno 185', '2009-05-23', '00000003185', '(12) 93000-0185', 'aluno185@email.com', 'Rua dos Alunos, 185'),
(186, 'Aluno 186', '2005-06-24', '00000003186', '(12) 93000-0186', 'aluno186@email.com', 'Rua dos Alunos, 186'),
(187, 'Aluno 187', '2006-07-25', '00000003187', '(12) 93000-0187', 'aluno187@email.com', 'Rua dos Alunos, 187'),
(188, 'Aluno 188', '2007-08-26', '00000003188', '(12) 93000-0188', 'aluno188@email.com', 'Rua dos Alunos, 188'),
(189, 'Aluno 189', '2008-09-27', '00000003189', '(12) 93000-0189', 'aluno189@email.com', 'Rua dos Alunos, 189'),
(190, 'Aluno 190', '2009-10-01', '00000003190', '(12) 93000-0190', 'aluno190@email.com', 'Rua dos Alunos, 190'),
(191, 'Aluno 191', '2005-11-02', '00000003191', '(12) 93000-0191', 'aluno191@email.com', 'Rua dos Alunos, 191'),
(192, 'Aluno 192', '2006-12-03', '00000003192', '(12) 93000-0192', 'aluno192@email.com', 'Rua dos Alunos, 192'),
(193, 'Aluno 193', '2007-01-04', '00000003193', '(12) 93000-0193', 'aluno193@email.com', 'Rua dos Alunos, 193'),
(194, 'Aluno 194', '2008-02-05', '00000003194', '(12) 93000-0194', 'aluno194@email.com', 'Rua dos Alunos, 194'),
(195, 'Aluno 195', '2009-03-06', '00000003195', '(12) 93000-0195', 'aluno195@email.com', 'Rua dos Alunos, 195'),
(196, 'Aluno 196', '2005-04-07', '00000003196', '(12) 93000-0196', 'aluno196@email.com', 'Rua dos Alunos, 196'),
(197, 'Aluno 197', '2006-05-08', '00000003197', '(12) 93000-0197', 'aluno197@email.com', 'Rua dos Alunos, 197'),
(198, 'Aluno 198', '2007-06-09', '00000003198', '(12) 93000-0198', 'aluno198@email.com', 'Rua dos Alunos, 198'),
(199, 'Aluno 199', '2008-07-10', '00000003199', '(12) 93000-0199', 'aluno199@email.com', 'Rua dos Alunos, 199'),
(200, 'Aluno 200', '2009-08-11', '00000003200', '(12) 93000-0200', 'aluno200@email.com', 'Rua dos Alunos, 200'),
(201, 'Aluno 201', '2005-09-12', '00000003201', '(12) 93000-0201', 'aluno201@email.com', 'Rua dos Alunos, 201'),
(202, 'Aluno 202', '2006-10-13', '00000003202', '(12) 93000-0202', 'aluno202@email.com', 'Rua dos Alunos, 202'),
(203, 'Aluno 203', '2007-11-14', '00000003203', '(12) 93000-0203', 'aluno203@email.com', 'Rua dos Alunos, 203'),
(204, 'Aluno 204', '2008-12-15', '00000003204', '(12) 93000-0204', 'aluno204@email.com', 'Rua dos Alunos, 204'),
(205, 'Aluno 205', '2009-01-16', '00000003205', '(12) 93000-0205', 'aluno205@email.com', 'Rua dos Alunos, 205'),
(206, 'Aluno 206', '2005-02-17', '00000003206', '(12) 93000-0206', 'aluno206@email.com', 'Rua dos Alunos, 206'),
(207, 'Aluno 207', '2006-03-18', '00000003207', '(12) 93000-0207', 'aluno207@email.com', 'Rua dos Alunos, 207'),
(208, 'Aluno 208', '2007-04-19', '00000003208', '(12) 93000-0208', 'aluno208@email.com', 'Rua dos Alunos, 208'),
(209, 'Aluno 209', '2008-05-20', '00000003209', '(12) 93000-0209', 'aluno209@email.com', 'Rua dos Alunos, 209'),
(210, 'Aluno 210', '2009-06-21', '00000003210', '(12) 93000-0210', 'aluno210@email.com', 'Rua dos Alunos, 210'),
(211, 'Aluno 211', '2005-07-22', '00000003211', '(12) 93000-0211', 'aluno211@email.com', 'Rua dos Alunos, 211'),
(212, 'Aluno 212', '2006-08-23', '00000003212', '(12) 93000-0212', 'aluno212@email.com', 'Rua dos Alunos, 212'),
(213, 'Aluno 213', '2007-09-24', '00000003213', '(12) 93000-0213', 'aluno213@email.com', 'Rua dos Alunos, 213'),
(214, 'Aluno 214', '2008-10-25', '00000003214', '(12) 93000-0214', 'aluno214@email.com', 'Rua dos Alunos, 214'),
(215, 'Aluno 215', '2009-11-26', '00000003215', '(12) 93000-0215', 'aluno215@email.com', 'Rua dos Alunos, 215'),
(216, 'Aluno 216', '2005-12-27', '00000003216', '(12) 93000-0216', 'aluno216@email.com', 'Rua dos Alunos, 216'),
(217, 'Aluno 217', '2006-01-01', '00000003217', '(12) 93000-0217', 'aluno217@email.com', 'Rua dos Alunos, 217'),
(218, 'Aluno 218', '2007-02-02', '00000003218', '(12) 93000-0218', 'aluno218@email.com', 'Rua dos Alunos, 218'),
(219, 'Aluno 219', '2008-03-03', '00000003219', '(12) 93000-0219', 'aluno219@email.com', 'Rua dos Alunos, 219'),
(220, 'Aluno 220', '2009-04-04', '00000003220', '(12) 93000-0220', 'aluno220@email.com', 'Rua dos Alunos, 220'),
(221, 'Aluno 221', '2005-05-05', '00000003221', '(12) 93000-0221', 'aluno221@email.com', 'Rua dos Alunos, 221'),
(222, 'Aluno 222', '2006-06-06', '00000003222', '(12) 93000-0222', 'aluno222@email.com', 'Rua dos Alunos, 222'),
(223, 'Aluno 223', '2007-07-07', '00000003223', '(12) 93000-0223', 'aluno223@email.com', 'Rua dos Alunos, 223'),
(224, 'Aluno 224', '2008-08-08', '00000003224', '(12) 93000-0224', 'aluno224@email.com', 'Rua dos Alunos, 224'),
(225, 'Aluno 225', '2009-09-09', '00000003225', '(12) 93000-0225', 'aluno225@email.com', 'Rua dos Alunos, 225'),
(226, 'Aluno 226', '2005-10-10', '00000003226', '(12) 93000-0226', 'aluno226@email.com', 'Rua dos Alunos, 226'),
(227, 'Aluno 227', '2006-11-11', '00000003227', '(12) 93000-0227', 'aluno227@email.com', 'Rua dos Alunos, 227'),
(228, 'Aluno 228', '2007-12-12', '00000003228', '(12) 93000-0228', 'aluno228@email.com', 'Rua dos Alunos, 228'),
(229, 'Aluno 229', '2008-01-13', '00000003229', '(12) 93000-0229', 'aluno229@email.com', 'Rua dos Alunos, 229'),
(230, 'Aluno 230', '2009-02-14', '00000003230', '(12) 93000-0230', 'aluno230@email.com', 'Rua dos Alunos, 230'),
(231, 'Aluno 231', '2005-03-15', '00000003231', '(12) 93000-0231', 'aluno231@email.com', 'Rua dos Alunos, 231'),
(232, 'Aluno 232', '2006-04-16', '00000003232', '(12) 93000-0232', 'aluno232@email.com', 'Rua dos Alunos, 232'),
(233, 'Aluno 233', '2007-05-17', '00000003233', '(12) 93000-0233', 'aluno233@email.com', 'Rua dos Alunos, 233'),
(234, 'Aluno 234', '2008-06-18', '00000003234', '(12) 93000-0234', 'aluno234@email.com', 'Rua dos Alunos, 234'),
(235, 'Aluno 235', '2009-07-19', '00000003235', '(12) 93000-0235', 'aluno235@email.com', 'Rua dos Alunos, 235'),
(236, 'Aluno 236', '2005-08-20', '00000003236', '(12) 93000-0236', 'aluno236@email.com', 'Rua dos Alunos, 236'),
(237, 'Aluno 237', '2006-09-21', '00000003237', '(12) 93000-0237', 'aluno237@email.com', 'Rua dos Alunos, 237'),
(238, 'Aluno 238', '2007-10-22', '00000003238', '(12) 93000-0238', 'aluno238@email.com', 'Rua dos Alunos, 238'),
(239, 'Aluno 239', '2008-11-23', '00000003239', '(12) 93000-0239', 'aluno239@email.com', 'Rua dos Alunos, 239'),
(240, 'Aluno 240', '2009-12-24', '00000003240', '(12) 93000-0240', 'aluno240@email.com', 'Rua dos Alunos, 240'),
(241, 'Aluno 241', '2005-01-25', '00000003241', '(12) 93000-0241', 'aluno241@email.com', 'Rua dos Alunos, 241'),
(242, 'Aluno 242', '2006-02-26', '00000003242', '(12) 93000-0242', 'aluno242@email.com', 'Rua dos Alunos, 242'),
(243, 'Aluno 243', '2007-03-27', '00000003243', '(12) 93000-0243', 'aluno243@email.com', 'Rua dos Alunos, 243'),
(244, 'Aluno 244', '2008-04-01', '00000003244', '(12) 93000-0244', 'aluno244@email.com', 'Rua dos Alunos, 244'),
(245, 'Aluno 245', '2009-05-02', '00000003245', '(12) 93000-0245', 'aluno245@email.com', 'Rua dos Alunos, 245'),
(246, 'Aluno 246', '2005-06-03', '00000003246', '(12) 93000-0246', 'aluno246@email.com', 'Rua dos Alunos, 246'),
(247, 'Aluno 247', '2006-07-04', '00000003247', '(12) 93000-0247', 'aluno247@email.com', 'Rua dos Alunos, 247'),
(248, 'Aluno 248', '2007-08-05', '00000003248', '(12) 93000-0248', 'aluno248@email.com', 'Rua dos Alunos, 248'),
(249, 'Aluno 249', '2008-09-06', '00000003249', '(12) 93000-0249', 'aluno249@email.com', 'Rua dos Alunos, 249'),
(250, 'Aluno 250', '2009-10-07', '00000003250', '(12) 93000-0250', 'aluno250@email.com', 'Rua dos Alunos, 250');

-- --------------------------------------------------------

--
-- Estrutura para tabela `aluno_responsavel`
--

CREATE TABLE `aluno_responsavel` (
  `id_aluno_responsavel` int(11) NOT NULL,
  `id_aluno` int(11) NOT NULL,
  `id_responsavel` int(11) NOT NULL,
  `parentesco` varchar(50) NOT NULL,
  `responsavel_principal` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `aluno_responsavel`
--

INSERT INTO `aluno_responsavel` (`id_aluno_responsavel`, `id_aluno`, `id_responsavel`, `parentesco`, `responsavel_principal`) VALUES
(1, 1, 1, 'Mãe', 1),
(2, 2, 2, 'Pai', 1),
(3, 3, 3, 'Avó', 1),
(4, 4, 4, 'Avô', 1),
(5, 5, 5, 'Responsável legal', 1),
(6, 6, 6, 'Mãe', 1),
(7, 7, 7, 'Pai', 1),
(8, 8, 8, 'Avó', 1),
(9, 9, 9, 'Avô', 1),
(10, 10, 10, 'Responsável legal', 1),
(11, 11, 11, 'Mãe', 1),
(12, 12, 12, 'Pai', 1),
(13, 13, 13, 'Avó', 1),
(14, 14, 14, 'Avô', 1),
(15, 15, 15, 'Responsável legal', 1),
(16, 16, 16, 'Mãe', 1),
(17, 17, 17, 'Pai', 1),
(18, 18, 18, 'Avó', 1),
(19, 19, 19, 'Avô', 1),
(20, 20, 20, 'Responsável legal', 1),
(21, 21, 21, 'Mãe', 1),
(22, 22, 22, 'Pai', 1),
(23, 23, 23, 'Avó', 1),
(24, 24, 24, 'Avô', 1),
(25, 25, 25, 'Responsável legal', 1),
(26, 26, 26, 'Mãe', 1),
(27, 27, 27, 'Pai', 1),
(28, 28, 28, 'Avó', 1),
(29, 29, 29, 'Avô', 1),
(30, 30, 30, 'Responsável legal', 1),
(31, 31, 31, 'Mãe', 1),
(32, 32, 32, 'Pai', 1),
(33, 33, 33, 'Avó', 1),
(34, 34, 34, 'Avô', 1),
(35, 35, 35, 'Responsável legal', 1),
(36, 36, 36, 'Mãe', 1),
(37, 37, 37, 'Pai', 1),
(38, 38, 38, 'Avó', 1),
(39, 39, 39, 'Avô', 1),
(40, 40, 40, 'Responsável legal', 1),
(41, 41, 41, 'Mãe', 1),
(42, 42, 42, 'Pai', 1),
(43, 43, 43, 'Avó', 1),
(44, 44, 44, 'Avô', 1),
(45, 45, 45, 'Responsável legal', 1),
(46, 46, 46, 'Mãe', 1),
(47, 47, 47, 'Pai', 1),
(48, 48, 48, 'Avó', 1),
(49, 49, 49, 'Avô', 1),
(50, 50, 50, 'Responsável legal', 1),
(51, 51, 51, 'Mãe', 1),
(52, 52, 52, 'Pai', 1),
(53, 53, 53, 'Avó', 1),
(54, 54, 54, 'Avô', 1),
(55, 55, 55, 'Responsável legal', 1),
(56, 56, 56, 'Mãe', 1),
(57, 57, 57, 'Pai', 1),
(58, 58, 58, 'Avó', 1),
(59, 59, 59, 'Avô', 1),
(60, 60, 60, 'Responsável legal', 1),
(61, 61, 61, 'Mãe', 1),
(62, 62, 62, 'Pai', 1),
(63, 63, 63, 'Avó', 1),
(64, 64, 64, 'Avô', 1),
(65, 65, 65, 'Responsável legal', 1),
(66, 66, 66, 'Mãe', 1),
(67, 67, 67, 'Pai', 1),
(68, 68, 68, 'Avó', 1),
(69, 69, 69, 'Avô', 1),
(70, 70, 70, 'Responsável legal', 1),
(71, 71, 71, 'Mãe', 1),
(72, 72, 72, 'Pai', 1),
(73, 73, 73, 'Avó', 1),
(74, 74, 74, 'Avô', 1),
(75, 75, 75, 'Responsável legal', 1),
(76, 76, 76, 'Mãe', 1),
(77, 77, 77, 'Pai', 1),
(78, 78, 78, 'Avó', 1),
(79, 79, 79, 'Avô', 1),
(80, 80, 80, 'Responsável legal', 1),
(81, 81, 81, 'Mãe', 1),
(82, 82, 82, 'Pai', 1),
(83, 83, 83, 'Avó', 1),
(84, 84, 84, 'Avô', 1),
(85, 85, 85, 'Responsável legal', 1),
(86, 86, 86, 'Mãe', 1),
(87, 87, 87, 'Pai', 1),
(88, 88, 88, 'Avó', 1),
(89, 89, 89, 'Avô', 1),
(90, 90, 90, 'Responsável legal', 1),
(91, 91, 91, 'Mãe', 1),
(92, 92, 92, 'Pai', 1),
(93, 93, 93, 'Avó', 1),
(94, 94, 94, 'Avô', 1),
(95, 95, 95, 'Responsável legal', 1),
(96, 96, 96, 'Mãe', 1),
(97, 97, 97, 'Pai', 1),
(98, 98, 98, 'Avó', 1),
(99, 99, 99, 'Avô', 1),
(100, 100, 100, 'Responsável legal', 1),
(101, 101, 101, 'Mãe', 1),
(102, 102, 102, 'Pai', 1),
(103, 103, 103, 'Avó', 1),
(104, 104, 104, 'Avô', 1),
(105, 105, 105, 'Responsável legal', 1),
(106, 106, 106, 'Mãe', 1),
(107, 107, 107, 'Pai', 1),
(108, 108, 108, 'Avó', 1),
(109, 109, 109, 'Avô', 1),
(110, 110, 110, 'Responsável legal', 1),
(111, 111, 111, 'Mãe', 1),
(112, 112, 112, 'Pai', 1),
(113, 113, 113, 'Avó', 1),
(114, 114, 114, 'Avô', 1),
(115, 115, 115, 'Responsável legal', 1),
(116, 116, 116, 'Mãe', 1),
(117, 117, 117, 'Pai', 1),
(118, 118, 118, 'Avó', 1),
(119, 119, 119, 'Avô', 1),
(120, 120, 120, 'Responsável legal', 1),
(121, 121, 121, 'Mãe', 1),
(122, 122, 122, 'Pai', 1),
(123, 123, 123, 'Avó', 1),
(124, 124, 124, 'Avô', 1),
(125, 125, 125, 'Responsável legal', 1),
(126, 126, 126, 'Mãe', 1),
(127, 127, 127, 'Pai', 1),
(128, 128, 128, 'Avó', 1),
(129, 129, 129, 'Avô', 1),
(130, 130, 130, 'Responsável legal', 1),
(131, 131, 131, 'Mãe', 1),
(132, 132, 132, 'Pai', 1),
(133, 133, 133, 'Avó', 1),
(134, 134, 134, 'Avô', 1),
(135, 135, 135, 'Responsável legal', 1),
(136, 136, 136, 'Mãe', 1),
(137, 137, 137, 'Pai', 1),
(138, 138, 138, 'Avó', 1),
(139, 139, 139, 'Avô', 1),
(140, 140, 140, 'Responsável legal', 1),
(141, 141, 141, 'Mãe', 1),
(142, 142, 142, 'Pai', 1),
(143, 143, 143, 'Avó', 1),
(144, 144, 144, 'Avô', 1),
(145, 145, 145, 'Responsável legal', 1),
(146, 146, 146, 'Mãe', 1),
(147, 147, 147, 'Pai', 1),
(148, 148, 148, 'Avó', 1),
(149, 149, 149, 'Avô', 1),
(150, 150, 150, 'Responsável legal', 1),
(151, 151, 151, 'Mãe', 1),
(152, 152, 152, 'Pai', 1),
(153, 153, 153, 'Avó', 1),
(154, 154, 154, 'Avô', 1),
(155, 155, 155, 'Responsável legal', 1),
(156, 156, 156, 'Mãe', 1),
(157, 157, 157, 'Pai', 1),
(158, 158, 158, 'Avó', 1),
(159, 159, 159, 'Avô', 1),
(160, 160, 160, 'Responsável legal', 1),
(161, 161, 161, 'Mãe', 1),
(162, 162, 162, 'Pai', 1),
(163, 163, 163, 'Avó', 1),
(164, 164, 164, 'Avô', 1),
(165, 165, 165, 'Responsável legal', 1),
(166, 166, 166, 'Mãe', 1),
(167, 167, 167, 'Pai', 1),
(168, 168, 168, 'Avó', 1),
(169, 169, 169, 'Avô', 1),
(170, 170, 170, 'Responsável legal', 1),
(171, 171, 171, 'Mãe', 1),
(172, 172, 172, 'Pai', 1),
(173, 173, 173, 'Avó', 1),
(174, 174, 174, 'Avô', 1),
(175, 175, 175, 'Responsável legal', 1),
(176, 176, 176, 'Mãe', 1),
(177, 177, 177, 'Pai', 1),
(178, 178, 178, 'Avó', 1),
(179, 179, 179, 'Avô', 1),
(180, 180, 180, 'Responsável legal', 1),
(181, 181, 181, 'Mãe', 1),
(182, 182, 182, 'Pai', 1),
(183, 183, 183, 'Avó', 1),
(184, 184, 184, 'Avô', 1),
(185, 185, 185, 'Responsável legal', 1),
(186, 186, 186, 'Mãe', 1),
(187, 187, 187, 'Pai', 1),
(188, 188, 188, 'Avó', 1),
(189, 189, 189, 'Avô', 1),
(190, 190, 190, 'Responsável legal', 1),
(191, 191, 191, 'Mãe', 1),
(192, 192, 192, 'Pai', 1),
(193, 193, 193, 'Avó', 1),
(194, 194, 194, 'Avô', 1),
(195, 195, 195, 'Responsável legal', 1),
(196, 196, 196, 'Mãe', 1),
(197, 197, 197, 'Pai', 1),
(198, 198, 198, 'Avó', 1),
(199, 199, 199, 'Avô', 1),
(200, 200, 200, 'Responsável legal', 1),
(201, 201, 201, 'Mãe', 1),
(202, 202, 202, 'Pai', 1),
(203, 203, 203, 'Avó', 1),
(204, 204, 204, 'Avô', 1),
(205, 205, 205, 'Responsável legal', 1),
(206, 206, 206, 'Mãe', 1),
(207, 207, 207, 'Pai', 1),
(208, 208, 208, 'Avó', 1),
(209, 209, 209, 'Avô', 1),
(210, 210, 210, 'Responsável legal', 1),
(211, 211, 211, 'Mãe', 1),
(212, 212, 212, 'Pai', 1),
(213, 213, 213, 'Avó', 1),
(214, 214, 214, 'Avô', 1),
(215, 215, 215, 'Responsável legal', 1),
(216, 216, 216, 'Mãe', 1),
(217, 217, 217, 'Pai', 1),
(218, 218, 218, 'Avó', 1),
(219, 219, 219, 'Avô', 1),
(220, 220, 220, 'Responsável legal', 1),
(221, 221, 221, 'Mãe', 1),
(222, 222, 222, 'Pai', 1),
(223, 223, 223, 'Avó', 1),
(224, 224, 224, 'Avô', 1),
(225, 225, 225, 'Responsável legal', 1),
(226, 226, 226, 'Mãe', 1),
(227, 227, 227, 'Pai', 1),
(228, 228, 228, 'Avó', 1),
(229, 229, 229, 'Avô', 1),
(230, 230, 230, 'Responsável legal', 1),
(231, 231, 231, 'Mãe', 1),
(232, 232, 232, 'Pai', 1),
(233, 233, 233, 'Avó', 1),
(234, 234, 234, 'Avô', 1),
(235, 235, 235, 'Responsável legal', 1),
(236, 236, 236, 'Mãe', 1),
(237, 237, 237, 'Pai', 1),
(238, 238, 238, 'Avó', 1),
(239, 239, 239, 'Avô', 1),
(240, 240, 240, 'Responsável legal', 1),
(241, 241, 241, 'Mãe', 1),
(242, 242, 242, 'Pai', 1),
(243, 243, 243, 'Avó', 1),
(244, 244, 244, 'Avô', 1),
(245, 245, 245, 'Responsável legal', 1),
(246, 246, 246, 'Mãe', 1),
(247, 247, 247, 'Pai', 1),
(248, 248, 248, 'Avó', 1),
(249, 249, 249, 'Avô', 1),
(250, 250, 250, 'Responsável legal', 1);

-- --------------------------------------------------------

--
-- Estrutura para tabela `avaliacoes`
--

CREATE TABLE `avaliacoes` (
  `id_avaliacao` int(11) NOT NULL,
  `id_aluno` int(11) NOT NULL,
  `id_disciplina` int(11) NOT NULL,
  `descricao` varchar(150) NOT NULL,
  `data_avaliacao` date NOT NULL,
  `valor_maximo` decimal(5,2) NOT NULL DEFAULT 10.00,
  `nota` decimal(5,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `avaliacoes`
--

INSERT INTO `avaliacoes` (`id_avaliacao`, `id_aluno`, `id_disciplina`, `descricao`, `data_avaliacao`, `valor_maximo`, `nota`) VALUES
(1, 1, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.20),
(2, 1, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.30),
(3, 1, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.40),
(4, 1, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.50),
(5, 2, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.30),
(6, 2, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.40),
(7, 2, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.50),
(8, 2, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.60),
(9, 3, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.40),
(10, 3, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.50),
(11, 3, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.60),
(12, 3, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.70),
(13, 4, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.50),
(14, 4, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.60),
(15, 4, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.70),
(16, 4, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.80),
(17, 5, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.60),
(18, 5, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.70),
(19, 5, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.80),
(20, 5, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.90),
(21, 6, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.70),
(22, 6, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.80),
(23, 6, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.90),
(24, 6, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.00),
(25, 7, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.80),
(26, 7, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.90),
(27, 7, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.00),
(28, 7, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.10),
(29, 8, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.90),
(30, 8, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.00),
(31, 8, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.10),
(32, 8, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.20),
(33, 9, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.00),
(34, 9, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.10),
(35, 9, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.20),
(36, 9, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.30),
(37, 10, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.10),
(38, 10, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.20),
(39, 10, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.30),
(40, 10, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.40),
(41, 11, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.20),
(42, 11, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.30),
(43, 11, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.40),
(44, 11, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.50),
(45, 12, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.30),
(46, 12, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.40),
(47, 12, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.50),
(48, 12, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.60),
(49, 13, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.40),
(50, 13, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.50),
(51, 13, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.60),
(52, 13, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.70),
(53, 14, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.50),
(54, 14, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.60),
(55, 14, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.70),
(56, 14, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.80),
(57, 15, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.60),
(58, 15, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.70),
(59, 15, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.80),
(60, 15, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.90),
(61, 16, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.70),
(62, 16, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.80),
(63, 16, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.90),
(64, 16, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.00),
(65, 17, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.80),
(66, 17, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.90),
(67, 17, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.00),
(68, 17, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.10),
(69, 18, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.90),
(70, 18, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.00),
(71, 18, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.10),
(72, 18, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.20),
(73, 19, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.00),
(74, 19, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.10),
(75, 19, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.20),
(76, 19, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.30),
(77, 20, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.10),
(78, 20, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.20),
(79, 20, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.30),
(80, 20, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.40),
(81, 21, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.20),
(82, 21, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.30),
(83, 21, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.40),
(84, 21, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.50),
(85, 22, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.30),
(86, 22, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.40),
(87, 22, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.50),
(88, 22, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.60),
(89, 23, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.40),
(90, 23, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.50),
(91, 23, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.60),
(92, 23, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.70),
(93, 24, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.50),
(94, 24, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.60),
(95, 24, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.70),
(96, 24, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.80),
(97, 25, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.60),
(98, 25, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.70),
(99, 25, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.80),
(100, 25, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.90),
(101, 26, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.70),
(102, 26, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.80),
(103, 26, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.90),
(104, 26, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.00),
(105, 27, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.80),
(106, 27, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.90),
(107, 27, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.00),
(108, 27, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.10),
(109, 28, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.90),
(110, 28, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.00),
(111, 28, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.10),
(112, 28, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.20),
(113, 29, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.00),
(114, 29, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.10),
(115, 29, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.20),
(116, 29, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.30),
(117, 30, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.10),
(118, 30, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.20),
(119, 30, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.30),
(120, 30, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.40),
(121, 31, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.20),
(122, 31, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.30),
(123, 31, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.40),
(124, 31, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.50),
(125, 32, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.30),
(126, 32, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.40),
(127, 32, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.50),
(128, 32, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.60),
(129, 33, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.40),
(130, 33, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.50),
(131, 33, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.60),
(132, 33, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.70),
(133, 34, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.50),
(134, 34, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.60),
(135, 34, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.70),
(136, 34, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.80),
(137, 35, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.60),
(138, 35, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.70),
(139, 35, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.80),
(140, 35, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.90),
(141, 36, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.70),
(142, 36, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.80),
(143, 36, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.90),
(144, 36, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.00),
(145, 37, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.80),
(146, 37, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.90),
(147, 37, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.00),
(148, 37, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.10),
(149, 38, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.90),
(150, 38, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.00),
(151, 38, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.10),
(152, 38, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.20),
(153, 39, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.00),
(154, 39, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.10),
(155, 39, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.20),
(156, 39, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.30),
(157, 40, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.10),
(158, 40, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.20),
(159, 40, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.30),
(160, 40, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.40),
(161, 41, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.20),
(162, 41, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.30),
(163, 41, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.40),
(164, 41, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.50),
(165, 42, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.30),
(166, 42, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.40),
(167, 42, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.50),
(168, 42, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.60),
(169, 43, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.40),
(170, 43, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.50),
(171, 43, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.60),
(172, 43, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.70),
(173, 44, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.50),
(174, 44, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.60),
(175, 44, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.70),
(176, 44, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.80),
(177, 45, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.60),
(178, 45, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.70),
(179, 45, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.80),
(180, 45, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.90),
(181, 46, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.70),
(182, 46, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.80),
(183, 46, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.90),
(184, 46, 4, 'Avaliação 4', '2026-04-15', 10.00, 10.00),
(185, 47, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.80),
(186, 47, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.90),
(187, 47, 13, 'Avaliação 3', '2026-03-15', 10.00, 10.00),
(188, 47, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.00),
(189, 48, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.90),
(190, 48, 22, 'Avaliação 2', '2026-02-15', 10.00, 10.00),
(191, 48, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.00),
(192, 48, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.10),
(193, 49, 31, 'Avaliação 1', '2026-01-15', 10.00, 10.00),
(194, 49, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.00),
(195, 49, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.10),
(196, 49, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.20),
(197, 50, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.00),
(198, 50, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.10),
(199, 50, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.20),
(200, 50, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.30),
(201, 51, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.10),
(202, 51, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.20),
(203, 51, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.30),
(204, 51, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.40),
(205, 52, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.20),
(206, 52, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.30),
(207, 52, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.40),
(208, 52, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.50),
(209, 53, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.30),
(210, 53, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.40),
(211, 53, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.50),
(212, 53, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.60),
(213, 54, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.40),
(214, 54, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.50),
(215, 54, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.60),
(216, 54, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.70),
(217, 55, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.50),
(218, 55, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.60),
(219, 55, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.70),
(220, 55, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.80),
(221, 56, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.60),
(222, 56, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.70),
(223, 56, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.80),
(224, 56, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.90),
(225, 57, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.70),
(226, 57, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.80),
(227, 57, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.90),
(228, 57, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.00),
(229, 58, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.80),
(230, 58, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.90),
(231, 58, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.00),
(232, 58, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.10),
(233, 59, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.90),
(234, 59, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.00),
(235, 59, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.10),
(236, 59, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.20),
(237, 60, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.00),
(238, 60, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.10),
(239, 60, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.20),
(240, 60, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.30),
(241, 61, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.10),
(242, 61, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.20),
(243, 61, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.30),
(244, 61, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.40),
(245, 62, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.20),
(246, 62, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.30),
(247, 62, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.40),
(248, 62, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.50),
(249, 63, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.30),
(250, 63, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.40),
(251, 63, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.50),
(252, 63, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.60),
(253, 64, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.40),
(254, 64, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.50),
(255, 64, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.60),
(256, 64, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.70),
(257, 65, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.50),
(258, 65, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.60),
(259, 65, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.70),
(260, 65, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.80),
(261, 66, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.60),
(262, 66, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.70),
(263, 66, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.80),
(264, 66, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.90),
(265, 67, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.70),
(266, 67, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.80),
(267, 67, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.90),
(268, 67, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.00),
(269, 68, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.80),
(270, 68, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.90),
(271, 68, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.00),
(272, 68, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.10),
(273, 69, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.90),
(274, 69, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.00),
(275, 69, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.10),
(276, 69, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.20),
(277, 70, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.00),
(278, 70, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.10),
(279, 70, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.20),
(280, 70, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.30),
(281, 71, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.10),
(282, 71, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.20),
(283, 71, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.30),
(284, 71, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.40),
(285, 72, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.20),
(286, 72, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.30),
(287, 72, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.40),
(288, 72, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.50),
(289, 73, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.30),
(290, 73, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.40),
(291, 73, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.50),
(292, 73, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.60),
(293, 74, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.40),
(294, 74, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.50),
(295, 74, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.60),
(296, 74, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.70),
(297, 75, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.50),
(298, 75, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.60),
(299, 75, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.70),
(300, 75, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.80),
(301, 76, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.60),
(302, 76, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.70),
(303, 76, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.80),
(304, 76, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.90),
(305, 77, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.70),
(306, 77, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.80),
(307, 77, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.90),
(308, 77, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.00),
(309, 78, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.80),
(310, 78, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.90),
(311, 78, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.00),
(312, 78, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.10),
(313, 79, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.90),
(314, 79, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.00),
(315, 79, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.10),
(316, 79, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.20),
(317, 80, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.00),
(318, 80, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.10),
(319, 80, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.20),
(320, 80, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.30),
(321, 81, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.10),
(322, 81, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.20),
(323, 81, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.30),
(324, 81, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.40),
(325, 82, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.20),
(326, 82, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.30),
(327, 82, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.40),
(328, 82, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.50),
(329, 83, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.30),
(330, 83, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.40),
(331, 83, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.50),
(332, 83, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.60),
(333, 84, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.40),
(334, 84, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.50),
(335, 84, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.60),
(336, 84, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.70),
(337, 85, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.50),
(338, 85, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.60),
(339, 85, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.70),
(340, 85, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.80),
(341, 86, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.60),
(342, 86, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.70),
(343, 86, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.80),
(344, 86, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.90),
(345, 87, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.70),
(346, 87, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.80),
(347, 87, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.90),
(348, 87, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.00),
(349, 88, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.80),
(350, 88, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.90),
(351, 88, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.00),
(352, 88, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.10),
(353, 89, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.90),
(354, 89, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.00),
(355, 89, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.10),
(356, 89, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.20),
(357, 90, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.00),
(358, 90, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.10),
(359, 90, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.20),
(360, 90, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.30),
(361, 91, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.10),
(362, 91, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.20),
(363, 91, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.30),
(364, 91, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.40),
(365, 92, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.20),
(366, 92, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.30),
(367, 92, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.40),
(368, 92, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.50),
(369, 93, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.30),
(370, 93, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.40),
(371, 93, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.50),
(372, 93, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.60),
(373, 94, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.40),
(374, 94, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.50),
(375, 94, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.60),
(376, 94, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.70),
(377, 95, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.50),
(378, 95, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.60),
(379, 95, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.70),
(380, 95, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.80),
(381, 96, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.60),
(382, 96, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.70),
(383, 96, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.80),
(384, 96, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.90),
(385, 97, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.70),
(386, 97, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.80),
(387, 97, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.90),
(388, 97, 14, 'Avaliação 4', '2026-04-15', 10.00, 10.00),
(389, 98, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.80),
(390, 98, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.90),
(391, 98, 23, 'Avaliação 3', '2026-03-15', 10.00, 10.00),
(392, 98, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.00),
(393, 99, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.90),
(394, 99, 32, 'Avaliação 2', '2026-02-15', 10.00, 10.00),
(395, 99, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.00),
(396, 99, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.10),
(397, 100, 41, 'Avaliação 1', '2026-01-15', 10.00, 10.00),
(398, 100, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.00),
(399, 100, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.10),
(400, 100, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.20),
(401, 101, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.00),
(402, 101, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.10),
(403, 101, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.20),
(404, 101, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.30),
(405, 102, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.10),
(406, 102, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.20),
(407, 102, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.30),
(408, 102, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.40),
(409, 103, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.20),
(410, 103, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.30),
(411, 103, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.40),
(412, 103, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.50),
(413, 104, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.30),
(414, 104, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.40),
(415, 104, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.50),
(416, 104, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.60),
(417, 105, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.40),
(418, 105, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.50),
(419, 105, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.60),
(420, 105, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.70),
(421, 106, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.50),
(422, 106, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.60),
(423, 106, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.70),
(424, 106, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.80),
(425, 107, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.60),
(426, 107, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.70),
(427, 107, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.80),
(428, 107, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.90),
(429, 108, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.70),
(430, 108, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.80),
(431, 108, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.90),
(432, 108, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.00),
(433, 109, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.80),
(434, 109, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.90),
(435, 109, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.00),
(436, 109, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.10),
(437, 110, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.90),
(438, 110, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.00),
(439, 110, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.10),
(440, 110, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.20),
(441, 111, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.00),
(442, 111, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.10),
(443, 111, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.20),
(444, 111, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.30),
(445, 112, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.10),
(446, 112, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.20),
(447, 112, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.30),
(448, 112, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.40),
(449, 113, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.20),
(450, 113, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.30),
(451, 113, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.40),
(452, 113, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.50),
(453, 114, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.30),
(454, 114, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.40),
(455, 114, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.50),
(456, 114, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.60),
(457, 115, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.40),
(458, 115, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.50),
(459, 115, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.60),
(460, 115, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.70),
(461, 116, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.50),
(462, 116, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.60),
(463, 116, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.70),
(464, 116, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.80),
(465, 117, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.60),
(466, 117, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.70),
(467, 117, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.80),
(468, 117, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.90),
(469, 118, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.70),
(470, 118, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.80),
(471, 118, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.90),
(472, 118, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.00),
(473, 119, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.80),
(474, 119, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.90),
(475, 119, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.00),
(476, 119, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.10),
(477, 120, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.90),
(478, 120, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.00),
(479, 120, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.10),
(480, 120, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.20),
(481, 121, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.00),
(482, 121, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.10),
(483, 121, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.20),
(484, 121, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.30),
(485, 122, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.10),
(486, 122, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.20),
(487, 122, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.30),
(488, 122, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.40),
(489, 123, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.20),
(490, 123, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.30),
(491, 123, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.40),
(492, 123, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.50),
(493, 124, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.30),
(494, 124, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.40),
(495, 124, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.50),
(496, 124, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.60),
(497, 125, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.40),
(498, 125, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.50),
(499, 125, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.60),
(500, 125, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.70),
(501, 126, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.50),
(502, 126, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.60),
(503, 126, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.70),
(504, 126, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.80),
(505, 127, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.60),
(506, 127, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.70),
(507, 127, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.80),
(508, 127, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.90),
(509, 128, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.70),
(510, 128, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.80),
(511, 128, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.90),
(512, 128, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.00),
(513, 129, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.80),
(514, 129, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.90),
(515, 129, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.00),
(516, 129, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.10),
(517, 130, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.90),
(518, 130, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.00),
(519, 130, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.10),
(520, 130, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.20),
(521, 131, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.00),
(522, 131, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.10),
(523, 131, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.20),
(524, 131, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.30),
(525, 132, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.10),
(526, 132, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.20),
(527, 132, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.30),
(528, 132, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.40),
(529, 133, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.20),
(530, 133, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.30),
(531, 133, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.40),
(532, 133, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.50),
(533, 134, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.30),
(534, 134, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.40),
(535, 134, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.50),
(536, 134, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.60),
(537, 135, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.40),
(538, 135, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.50),
(539, 135, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.60),
(540, 135, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.70),
(541, 136, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.50),
(542, 136, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.60),
(543, 136, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.70),
(544, 136, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.80),
(545, 137, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.60),
(546, 137, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.70),
(547, 137, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.80),
(548, 137, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.90),
(549, 138, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.70),
(550, 138, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.80),
(551, 138, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.90),
(552, 138, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.00),
(553, 139, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.80),
(554, 139, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.90),
(555, 139, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.00),
(556, 139, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.10),
(557, 140, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.90),
(558, 140, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.00),
(559, 140, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.10),
(560, 140, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.20),
(561, 141, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.00),
(562, 141, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.10),
(563, 141, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.20),
(564, 141, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.30),
(565, 142, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.10),
(566, 142, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.20),
(567, 142, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.30),
(568, 142, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.40),
(569, 143, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.20),
(570, 143, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.30),
(571, 143, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.40),
(572, 143, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.50),
(573, 144, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.30),
(574, 144, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.40),
(575, 144, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.50),
(576, 144, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.60),
(577, 145, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.40),
(578, 145, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.50),
(579, 145, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.60),
(580, 145, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.70),
(581, 146, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.50),
(582, 146, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.60),
(583, 146, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.70),
(584, 146, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.80),
(585, 147, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.60),
(586, 147, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.70),
(587, 147, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.80),
(588, 147, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.90),
(589, 148, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.70),
(590, 148, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.80),
(591, 148, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.90),
(592, 148, 24, 'Avaliação 4', '2026-04-15', 10.00, 10.00),
(593, 149, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.80),
(594, 149, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.90),
(595, 149, 33, 'Avaliação 3', '2026-03-15', 10.00, 10.00),
(596, 149, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.00),
(597, 150, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.90),
(598, 150, 42, 'Avaliação 2', '2026-02-15', 10.00, 10.00),
(599, 150, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.00),
(600, 150, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.10),
(601, 151, 1, 'Avaliação 1', '2026-01-15', 10.00, 10.00),
(602, 151, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.00),
(603, 151, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.10),
(604, 151, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.20),
(605, 152, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.00),
(606, 152, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.10),
(607, 152, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.20),
(608, 152, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.30),
(609, 153, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.10),
(610, 153, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.20),
(611, 153, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.30),
(612, 153, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.40),
(613, 154, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.20),
(614, 154, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.30),
(615, 154, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.40),
(616, 154, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.50),
(617, 155, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.30),
(618, 155, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.40),
(619, 155, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.50),
(620, 155, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.60),
(621, 156, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.40),
(622, 156, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.50),
(623, 156, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.60),
(624, 156, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.70),
(625, 157, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.50),
(626, 157, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.60),
(627, 157, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.70),
(628, 157, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.80),
(629, 158, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.60),
(630, 158, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.70),
(631, 158, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.80),
(632, 158, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.90),
(633, 159, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.70),
(634, 159, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.80),
(635, 159, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.90),
(636, 159, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.00),
(637, 160, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.80),
(638, 160, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.90),
(639, 160, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.00),
(640, 160, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.10),
(641, 161, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.90),
(642, 161, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.00),
(643, 161, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.10),
(644, 161, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.20),
(645, 162, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.00),
(646, 162, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.10),
(647, 162, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.20),
(648, 162, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.30),
(649, 163, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.10),
(650, 163, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.20),
(651, 163, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.30),
(652, 163, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.40),
(653, 164, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.20),
(654, 164, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.30),
(655, 164, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.40),
(656, 164, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.50),
(657, 165, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.30),
(658, 165, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.40),
(659, 165, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.50),
(660, 165, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.60),
(661, 166, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.40),
(662, 166, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.50),
(663, 166, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.60),
(664, 166, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.70),
(665, 167, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.50),
(666, 167, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.60),
(667, 167, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.70),
(668, 167, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.80),
(669, 168, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.60),
(670, 168, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.70),
(671, 168, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.80),
(672, 168, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.90),
(673, 169, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.70),
(674, 169, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.80),
(675, 169, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.90),
(676, 169, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.00),
(677, 170, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.80),
(678, 170, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.90),
(679, 170, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.00),
(680, 170, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.10),
(681, 171, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.90),
(682, 171, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.00),
(683, 171, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.10),
(684, 171, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.20),
(685, 172, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.00),
(686, 172, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.10),
(687, 172, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.20),
(688, 172, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.30),
(689, 173, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.10),
(690, 173, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.20),
(691, 173, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.30),
(692, 173, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.40),
(693, 174, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.20),
(694, 174, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.30),
(695, 174, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.40),
(696, 174, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.50),
(697, 175, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.30),
(698, 175, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.40),
(699, 175, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.50),
(700, 175, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.60),
(701, 176, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.40),
(702, 176, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.50),
(703, 176, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.60),
(704, 176, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.70),
(705, 177, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.50),
(706, 177, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.60),
(707, 177, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.70),
(708, 177, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.80),
(709, 178, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.60),
(710, 178, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.70),
(711, 178, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.80),
(712, 178, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.90),
(713, 179, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.70),
(714, 179, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.80),
(715, 179, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.90),
(716, 179, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.00),
(717, 180, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.80),
(718, 180, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.90),
(719, 180, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.00),
(720, 180, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.10),
(721, 181, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.90),
(722, 181, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.00),
(723, 181, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.10),
(724, 181, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.20),
(725, 182, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.00),
(726, 182, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.10),
(727, 182, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.20),
(728, 182, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.30),
(729, 183, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.10),
(730, 183, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.20),
(731, 183, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.30),
(732, 183, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.40),
(733, 184, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.20),
(734, 184, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.30),
(735, 184, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.40),
(736, 184, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.50),
(737, 185, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.30),
(738, 185, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.40),
(739, 185, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.50),
(740, 185, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.60),
(741, 186, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.40),
(742, 186, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.50),
(743, 186, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.60),
(744, 186, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.70),
(745, 187, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.50),
(746, 187, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.60),
(747, 187, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.70),
(748, 187, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.80),
(749, 188, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.60),
(750, 188, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.70),
(751, 188, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.80),
(752, 188, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.90),
(753, 189, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.70),
(754, 189, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.80),
(755, 189, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.90),
(756, 189, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.00),
(757, 190, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.80),
(758, 190, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.90),
(759, 190, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.00),
(760, 190, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.10),
(761, 191, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.90),
(762, 191, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.00),
(763, 191, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.10),
(764, 191, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.20),
(765, 192, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.00),
(766, 192, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.10),
(767, 192, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.20),
(768, 192, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.30),
(769, 193, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.10),
(770, 193, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.20),
(771, 193, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.30),
(772, 193, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.40),
(773, 194, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.20),
(774, 194, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.30),
(775, 194, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.40),
(776, 194, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.50),
(777, 195, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.30),
(778, 195, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.40),
(779, 195, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.50),
(780, 195, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.60),
(781, 196, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.40),
(782, 196, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.50),
(783, 196, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.60),
(784, 196, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.70),
(785, 197, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.50),
(786, 197, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.60),
(787, 197, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.70),
(788, 197, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.80),
(789, 198, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.60),
(790, 198, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.70),
(791, 198, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.80),
(792, 198, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.90),
(793, 199, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.70),
(794, 199, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.80),
(795, 199, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.90),
(796, 199, 34, 'Avaliação 4', '2026-04-15', 10.00, 10.00),
(797, 200, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.80),
(798, 200, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.90),
(799, 200, 43, 'Avaliação 3', '2026-03-15', 10.00, 10.00),
(800, 200, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.00),
(801, 201, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.90),
(802, 201, 2, 'Avaliação 2', '2026-02-15', 10.00, 10.00),
(803, 201, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.00),
(804, 201, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.10),
(805, 202, 11, 'Avaliação 1', '2026-01-15', 10.00, 10.00),
(806, 202, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.00),
(807, 202, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.10),
(808, 202, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.20),
(809, 203, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.00),
(810, 203, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.10),
(811, 203, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.20),
(812, 203, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.30),
(813, 204, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.10),
(814, 204, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.20),
(815, 204, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.30),
(816, 204, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.40),
(817, 205, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.20),
(818, 205, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.30),
(819, 205, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.40),
(820, 205, 44, 'Avaliação 4', '2026-04-15', 10.00, 5.50),
(821, 206, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.30),
(822, 206, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.40),
(823, 206, 3, 'Avaliação 3', '2026-03-15', 10.00, 5.50),
(824, 206, 4, 'Avaliação 4', '2026-04-15', 10.00, 5.60),
(825, 207, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.40),
(826, 207, 12, 'Avaliação 2', '2026-02-15', 10.00, 5.50),
(827, 207, 13, 'Avaliação 3', '2026-03-15', 10.00, 5.60),
(828, 207, 14, 'Avaliação 4', '2026-04-15', 10.00, 5.70),
(829, 208, 21, 'Avaliação 1', '2026-01-15', 10.00, 5.50),
(830, 208, 22, 'Avaliação 2', '2026-02-15', 10.00, 5.60),
(831, 208, 23, 'Avaliação 3', '2026-03-15', 10.00, 5.70),
(832, 208, 24, 'Avaliação 4', '2026-04-15', 10.00, 5.80),
(833, 209, 31, 'Avaliação 1', '2026-01-15', 10.00, 5.60),
(834, 209, 32, 'Avaliação 2', '2026-02-15', 10.00, 5.70),
(835, 209, 33, 'Avaliação 3', '2026-03-15', 10.00, 5.80),
(836, 209, 34, 'Avaliação 4', '2026-04-15', 10.00, 5.90),
(837, 210, 41, 'Avaliação 1', '2026-01-15', 10.00, 5.70),
(838, 210, 42, 'Avaliação 2', '2026-02-15', 10.00, 5.80),
(839, 210, 43, 'Avaliação 3', '2026-03-15', 10.00, 5.90),
(840, 210, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.00),
(841, 211, 1, 'Avaliação 1', '2026-01-15', 10.00, 5.80),
(842, 211, 2, 'Avaliação 2', '2026-02-15', 10.00, 5.90),
(843, 211, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.00),
(844, 211, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.10),
(845, 212, 11, 'Avaliação 1', '2026-01-15', 10.00, 5.90),
(846, 212, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.00),
(847, 212, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.10),
(848, 212, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.20),
(849, 213, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.00),
(850, 213, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.10),
(851, 213, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.20),
(852, 213, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.30),
(853, 214, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.10),
(854, 214, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.20),
(855, 214, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.30),
(856, 214, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.40),
(857, 215, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.20),
(858, 215, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.30),
(859, 215, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.40),
(860, 215, 44, 'Avaliação 4', '2026-04-15', 10.00, 6.50),
(861, 216, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.30),
(862, 216, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.40),
(863, 216, 3, 'Avaliação 3', '2026-03-15', 10.00, 6.50),
(864, 216, 4, 'Avaliação 4', '2026-04-15', 10.00, 6.60),
(865, 217, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.40),
(866, 217, 12, 'Avaliação 2', '2026-02-15', 10.00, 6.50),
(867, 217, 13, 'Avaliação 3', '2026-03-15', 10.00, 6.60),
(868, 217, 14, 'Avaliação 4', '2026-04-15', 10.00, 6.70),
(869, 218, 21, 'Avaliação 1', '2026-01-15', 10.00, 6.50),
(870, 218, 22, 'Avaliação 2', '2026-02-15', 10.00, 6.60),
(871, 218, 23, 'Avaliação 3', '2026-03-15', 10.00, 6.70),
(872, 218, 24, 'Avaliação 4', '2026-04-15', 10.00, 6.80),
(873, 219, 31, 'Avaliação 1', '2026-01-15', 10.00, 6.60),
(874, 219, 32, 'Avaliação 2', '2026-02-15', 10.00, 6.70),
(875, 219, 33, 'Avaliação 3', '2026-03-15', 10.00, 6.80),
(876, 219, 34, 'Avaliação 4', '2026-04-15', 10.00, 6.90),
(877, 220, 41, 'Avaliação 1', '2026-01-15', 10.00, 6.70),
(878, 220, 42, 'Avaliação 2', '2026-02-15', 10.00, 6.80),
(879, 220, 43, 'Avaliação 3', '2026-03-15', 10.00, 6.90),
(880, 220, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.00),
(881, 221, 1, 'Avaliação 1', '2026-01-15', 10.00, 6.80),
(882, 221, 2, 'Avaliação 2', '2026-02-15', 10.00, 6.90),
(883, 221, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.00),
(884, 221, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.10),
(885, 222, 11, 'Avaliação 1', '2026-01-15', 10.00, 6.90),
(886, 222, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.00),
(887, 222, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.10),
(888, 222, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.20),
(889, 223, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.00),
(890, 223, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.10),
(891, 223, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.20),
(892, 223, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.30),
(893, 224, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.10),
(894, 224, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.20),
(895, 224, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.30),
(896, 224, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.40),
(897, 225, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.20),
(898, 225, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.30),
(899, 225, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.40),
(900, 225, 44, 'Avaliação 4', '2026-04-15', 10.00, 7.50),
(901, 226, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.30),
(902, 226, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.40),
(903, 226, 3, 'Avaliação 3', '2026-03-15', 10.00, 7.50);
INSERT INTO `avaliacoes` (`id_avaliacao`, `id_aluno`, `id_disciplina`, `descricao`, `data_avaliacao`, `valor_maximo`, `nota`) VALUES
(904, 226, 4, 'Avaliação 4', '2026-04-15', 10.00, 7.60),
(905, 227, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.40),
(906, 227, 12, 'Avaliação 2', '2026-02-15', 10.00, 7.50),
(907, 227, 13, 'Avaliação 3', '2026-03-15', 10.00, 7.60),
(908, 227, 14, 'Avaliação 4', '2026-04-15', 10.00, 7.70),
(909, 228, 21, 'Avaliação 1', '2026-01-15', 10.00, 7.50),
(910, 228, 22, 'Avaliação 2', '2026-02-15', 10.00, 7.60),
(911, 228, 23, 'Avaliação 3', '2026-03-15', 10.00, 7.70),
(912, 228, 24, 'Avaliação 4', '2026-04-15', 10.00, 7.80),
(913, 229, 31, 'Avaliação 1', '2026-01-15', 10.00, 7.60),
(914, 229, 32, 'Avaliação 2', '2026-02-15', 10.00, 7.70),
(915, 229, 33, 'Avaliação 3', '2026-03-15', 10.00, 7.80),
(916, 229, 34, 'Avaliação 4', '2026-04-15', 10.00, 7.90),
(917, 230, 41, 'Avaliação 1', '2026-01-15', 10.00, 7.70),
(918, 230, 42, 'Avaliação 2', '2026-02-15', 10.00, 7.80),
(919, 230, 43, 'Avaliação 3', '2026-03-15', 10.00, 7.90),
(920, 230, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.00),
(921, 231, 1, 'Avaliação 1', '2026-01-15', 10.00, 7.80),
(922, 231, 2, 'Avaliação 2', '2026-02-15', 10.00, 7.90),
(923, 231, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.00),
(924, 231, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.10),
(925, 232, 11, 'Avaliação 1', '2026-01-15', 10.00, 7.90),
(926, 232, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.00),
(927, 232, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.10),
(928, 232, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.20),
(929, 233, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.00),
(930, 233, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.10),
(931, 233, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.20),
(932, 233, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.30),
(933, 234, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.10),
(934, 234, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.20),
(935, 234, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.30),
(936, 234, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.40),
(937, 235, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.20),
(938, 235, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.30),
(939, 235, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.40),
(940, 235, 44, 'Avaliação 4', '2026-04-15', 10.00, 8.50),
(941, 236, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.30),
(942, 236, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.40),
(943, 236, 3, 'Avaliação 3', '2026-03-15', 10.00, 8.50),
(944, 236, 4, 'Avaliação 4', '2026-04-15', 10.00, 8.60),
(945, 237, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.40),
(946, 237, 12, 'Avaliação 2', '2026-02-15', 10.00, 8.50),
(947, 237, 13, 'Avaliação 3', '2026-03-15', 10.00, 8.60),
(948, 237, 14, 'Avaliação 4', '2026-04-15', 10.00, 8.70),
(949, 238, 21, 'Avaliação 1', '2026-01-15', 10.00, 8.50),
(950, 238, 22, 'Avaliação 2', '2026-02-15', 10.00, 8.60),
(951, 238, 23, 'Avaliação 3', '2026-03-15', 10.00, 8.70),
(952, 238, 24, 'Avaliação 4', '2026-04-15', 10.00, 8.80),
(953, 239, 31, 'Avaliação 1', '2026-01-15', 10.00, 8.60),
(954, 239, 32, 'Avaliação 2', '2026-02-15', 10.00, 8.70),
(955, 239, 33, 'Avaliação 3', '2026-03-15', 10.00, 8.80),
(956, 239, 34, 'Avaliação 4', '2026-04-15', 10.00, 8.90),
(957, 240, 41, 'Avaliação 1', '2026-01-15', 10.00, 8.70),
(958, 240, 42, 'Avaliação 2', '2026-02-15', 10.00, 8.80),
(959, 240, 43, 'Avaliação 3', '2026-03-15', 10.00, 8.90),
(960, 240, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.00),
(961, 241, 1, 'Avaliação 1', '2026-01-15', 10.00, 8.80),
(962, 241, 2, 'Avaliação 2', '2026-02-15', 10.00, 8.90),
(963, 241, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.00),
(964, 241, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.10),
(965, 242, 11, 'Avaliação 1', '2026-01-15', 10.00, 8.90),
(966, 242, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.00),
(967, 242, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.10),
(968, 242, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.20),
(969, 243, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.00),
(970, 243, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.10),
(971, 243, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.20),
(972, 243, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.30),
(973, 244, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.10),
(974, 244, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.20),
(975, 244, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.30),
(976, 244, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.40),
(977, 245, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.20),
(978, 245, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.30),
(979, 245, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.40),
(980, 245, 44, 'Avaliação 4', '2026-04-15', 10.00, 9.50),
(981, 246, 1, 'Avaliação 1', '2026-01-15', 10.00, 9.30),
(982, 246, 2, 'Avaliação 2', '2026-02-15', 10.00, 9.40),
(983, 246, 3, 'Avaliação 3', '2026-03-15', 10.00, 9.50),
(984, 246, 4, 'Avaliação 4', '2026-04-15', 10.00, 9.60),
(985, 247, 11, 'Avaliação 1', '2026-01-15', 10.00, 9.40),
(986, 247, 12, 'Avaliação 2', '2026-02-15', 10.00, 9.50),
(987, 247, 13, 'Avaliação 3', '2026-03-15', 10.00, 9.60),
(988, 247, 14, 'Avaliação 4', '2026-04-15', 10.00, 9.70),
(989, 248, 21, 'Avaliação 1', '2026-01-15', 10.00, 9.50),
(990, 248, 22, 'Avaliação 2', '2026-02-15', 10.00, 9.60),
(991, 248, 23, 'Avaliação 3', '2026-03-15', 10.00, 9.70),
(992, 248, 24, 'Avaliação 4', '2026-04-15', 10.00, 9.80),
(993, 249, 31, 'Avaliação 1', '2026-01-15', 10.00, 9.60),
(994, 249, 32, 'Avaliação 2', '2026-02-15', 10.00, 9.70),
(995, 249, 33, 'Avaliação 3', '2026-03-15', 10.00, 9.80),
(996, 249, 34, 'Avaliação 4', '2026-04-15', 10.00, 9.90),
(997, 250, 41, 'Avaliação 1', '2026-01-15', 10.00, 9.70),
(998, 250, 42, 'Avaliação 2', '2026-02-15', 10.00, 9.80),
(999, 250, 43, 'Avaliação 3', '2026-03-15', 10.00, 9.90),
(1000, 250, 44, 'Avaliação 4', '2026-04-15', 10.00, 10.00);

-- --------------------------------------------------------

--
-- Estrutura para tabela `boletins`
--

CREATE TABLE `boletins` (
  `id_boletim` int(11) NOT NULL,
  `id_aluno` int(11) NOT NULL,
  `ano_letivo` year(4) NOT NULL,
  `media_final` decimal(5,2) NOT NULL,
  `frequencia` decimal(5,2) NOT NULL,
  `situacao_final` enum('Aprovado','Reprovado','Em recuperação') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `boletins`
--

INSERT INTO `boletins` (`id_boletim`, `id_aluno`, `ano_letivo`, `media_final`, `frequencia`, `situacao_final`) VALUES
(1, 1, '2026', 5.10, 76.00, 'Em recuperação'),
(2, 2, '2026', 5.20, 77.00, 'Em recuperação'),
(3, 3, '2026', 5.30, 78.00, 'Em recuperação'),
(4, 4, '2026', 5.40, 79.00, 'Em recuperação'),
(5, 5, '2026', 5.50, 80.00, 'Em recuperação'),
(6, 6, '2026', 5.60, 81.00, 'Em recuperação'),
(7, 7, '2026', 5.70, 82.00, 'Em recuperação'),
(8, 8, '2026', 5.80, 83.00, 'Em recuperação'),
(9, 9, '2026', 5.90, 84.00, 'Em recuperação'),
(10, 10, '2026', 6.00, 85.00, 'Aprovado'),
(11, 11, '2026', 6.10, 86.00, 'Aprovado'),
(12, 12, '2026', 6.20, 87.00, 'Aprovado'),
(13, 13, '2026', 6.30, 88.00, 'Aprovado'),
(14, 14, '2026', 6.40, 89.00, 'Aprovado'),
(15, 15, '2026', 6.50, 90.00, 'Aprovado'),
(16, 16, '2026', 6.60, 91.00, 'Aprovado'),
(17, 17, '2026', 6.70, 92.00, 'Aprovado'),
(18, 18, '2026', 6.80, 93.00, 'Aprovado'),
(19, 19, '2026', 6.90, 94.00, 'Aprovado'),
(20, 20, '2026', 7.00, 95.00, 'Aprovado'),
(21, 21, '2026', 7.10, 96.00, 'Aprovado'),
(22, 22, '2026', 7.20, 97.00, 'Aprovado'),
(23, 23, '2026', 7.30, 98.00, 'Aprovado'),
(24, 24, '2026', 7.40, 99.00, 'Aprovado'),
(25, 25, '2026', 7.50, 100.00, 'Aprovado'),
(26, 26, '2026', 7.60, 75.00, 'Aprovado'),
(27, 27, '2026', 7.70, 76.00, 'Aprovado'),
(28, 28, '2026', 7.80, 77.00, 'Aprovado'),
(29, 29, '2026', 7.90, 78.00, 'Aprovado'),
(30, 30, '2026', 8.00, 79.00, 'Aprovado'),
(31, 31, '2026', 8.10, 80.00, 'Aprovado'),
(32, 32, '2026', 8.20, 81.00, 'Aprovado'),
(33, 33, '2026', 8.30, 82.00, 'Aprovado'),
(34, 34, '2026', 8.40, 83.00, 'Aprovado'),
(35, 35, '2026', 8.50, 84.00, 'Aprovado'),
(36, 36, '2026', 8.60, 85.00, 'Aprovado'),
(37, 37, '2026', 8.70, 86.00, 'Aprovado'),
(38, 38, '2026', 8.80, 87.00, 'Aprovado'),
(39, 39, '2026', 8.90, 88.00, 'Aprovado'),
(40, 40, '2026', 9.00, 89.00, 'Aprovado'),
(41, 41, '2026', 9.10, 90.00, 'Aprovado'),
(42, 42, '2026', 9.20, 91.00, 'Aprovado'),
(43, 43, '2026', 9.30, 92.00, 'Aprovado'),
(44, 44, '2026', 9.40, 93.00, 'Aprovado'),
(45, 45, '2026', 9.50, 94.00, 'Aprovado'),
(46, 46, '2026', 9.60, 95.00, 'Aprovado'),
(47, 47, '2026', 9.70, 96.00, 'Aprovado'),
(48, 48, '2026', 9.80, 97.00, 'Aprovado'),
(49, 49, '2026', 9.90, 98.00, 'Aprovado'),
(50, 50, '2026', 10.00, 99.00, 'Aprovado'),
(51, 51, '2026', 5.00, 100.00, 'Em recuperação'),
(52, 52, '2026', 5.10, 75.00, 'Em recuperação'),
(53, 53, '2026', 5.20, 76.00, 'Em recuperação'),
(54, 54, '2026', 5.30, 77.00, 'Em recuperação'),
(55, 55, '2026', 5.40, 78.00, 'Em recuperação'),
(56, 56, '2026', 5.50, 79.00, 'Em recuperação'),
(57, 57, '2026', 5.60, 80.00, 'Em recuperação'),
(58, 58, '2026', 5.70, 81.00, 'Em recuperação'),
(59, 59, '2026', 5.80, 82.00, 'Em recuperação'),
(60, 60, '2026', 5.90, 83.00, 'Em recuperação'),
(61, 61, '2026', 6.00, 84.00, 'Aprovado'),
(62, 62, '2026', 6.10, 85.00, 'Aprovado'),
(63, 63, '2026', 6.20, 86.00, 'Aprovado'),
(64, 64, '2026', 6.30, 87.00, 'Aprovado'),
(65, 65, '2026', 6.40, 88.00, 'Aprovado'),
(66, 66, '2026', 6.50, 89.00, 'Aprovado'),
(67, 67, '2026', 6.60, 90.00, 'Aprovado'),
(68, 68, '2026', 6.70, 91.00, 'Aprovado'),
(69, 69, '2026', 6.80, 92.00, 'Aprovado'),
(70, 70, '2026', 6.90, 93.00, 'Aprovado'),
(71, 71, '2026', 7.00, 94.00, 'Aprovado'),
(72, 72, '2026', 7.10, 95.00, 'Aprovado'),
(73, 73, '2026', 7.20, 96.00, 'Aprovado'),
(74, 74, '2026', 7.30, 97.00, 'Aprovado'),
(75, 75, '2026', 7.40, 98.00, 'Aprovado'),
(76, 76, '2026', 7.50, 99.00, 'Aprovado'),
(77, 77, '2026', 7.60, 100.00, 'Aprovado'),
(78, 78, '2026', 7.70, 75.00, 'Aprovado'),
(79, 79, '2026', 7.80, 76.00, 'Aprovado'),
(80, 80, '2026', 7.90, 77.00, 'Aprovado'),
(81, 81, '2026', 8.00, 78.00, 'Aprovado'),
(82, 82, '2026', 8.10, 79.00, 'Aprovado'),
(83, 83, '2026', 8.20, 80.00, 'Aprovado'),
(84, 84, '2026', 8.30, 81.00, 'Aprovado'),
(85, 85, '2026', 8.40, 82.00, 'Aprovado'),
(86, 86, '2026', 8.50, 83.00, 'Aprovado'),
(87, 87, '2026', 8.60, 84.00, 'Aprovado'),
(88, 88, '2026', 8.70, 85.00, 'Aprovado'),
(89, 89, '2026', 8.80, 86.00, 'Aprovado'),
(90, 90, '2026', 8.90, 87.00, 'Aprovado'),
(91, 91, '2026', 9.00, 88.00, 'Aprovado'),
(92, 92, '2026', 9.10, 89.00, 'Aprovado'),
(93, 93, '2026', 9.20, 90.00, 'Aprovado'),
(94, 94, '2026', 9.30, 91.00, 'Aprovado'),
(95, 95, '2026', 9.40, 92.00, 'Aprovado'),
(96, 96, '2026', 9.50, 93.00, 'Aprovado'),
(97, 97, '2026', 9.60, 94.00, 'Aprovado'),
(98, 98, '2026', 9.70, 95.00, 'Aprovado'),
(99, 99, '2026', 9.80, 96.00, 'Aprovado'),
(100, 100, '2026', 9.90, 97.00, 'Aprovado'),
(101, 101, '2026', 10.00, 98.00, 'Aprovado'),
(102, 102, '2026', 5.00, 99.00, 'Em recuperação'),
(103, 103, '2026', 5.10, 100.00, 'Em recuperação'),
(104, 104, '2026', 5.20, 75.00, 'Em recuperação'),
(105, 105, '2026', 5.30, 76.00, 'Em recuperação'),
(106, 106, '2026', 5.40, 77.00, 'Em recuperação'),
(107, 107, '2026', 5.50, 78.00, 'Em recuperação'),
(108, 108, '2026', 5.60, 79.00, 'Em recuperação'),
(109, 109, '2026', 5.70, 80.00, 'Em recuperação'),
(110, 110, '2026', 5.80, 81.00, 'Em recuperação'),
(111, 111, '2026', 5.90, 82.00, 'Em recuperação'),
(112, 112, '2026', 6.00, 83.00, 'Aprovado'),
(113, 113, '2026', 6.10, 84.00, 'Aprovado'),
(114, 114, '2026', 6.20, 85.00, 'Aprovado'),
(115, 115, '2026', 6.30, 86.00, 'Aprovado'),
(116, 116, '2026', 6.40, 87.00, 'Aprovado'),
(117, 117, '2026', 6.50, 88.00, 'Aprovado'),
(118, 118, '2026', 6.60, 89.00, 'Aprovado'),
(119, 119, '2026', 6.70, 90.00, 'Aprovado'),
(120, 120, '2026', 6.80, 91.00, 'Aprovado'),
(121, 121, '2026', 6.90, 92.00, 'Aprovado'),
(122, 122, '2026', 7.00, 93.00, 'Aprovado'),
(123, 123, '2026', 7.10, 94.00, 'Aprovado'),
(124, 124, '2026', 7.20, 95.00, 'Aprovado'),
(125, 125, '2026', 7.30, 96.00, 'Aprovado'),
(126, 126, '2026', 7.40, 97.00, 'Aprovado'),
(127, 127, '2026', 7.50, 98.00, 'Aprovado'),
(128, 128, '2026', 7.60, 99.00, 'Aprovado'),
(129, 129, '2026', 7.70, 100.00, 'Aprovado'),
(130, 130, '2026', 7.80, 75.00, 'Aprovado'),
(131, 131, '2026', 7.90, 76.00, 'Aprovado'),
(132, 132, '2026', 8.00, 77.00, 'Aprovado'),
(133, 133, '2026', 8.10, 78.00, 'Aprovado'),
(134, 134, '2026', 8.20, 79.00, 'Aprovado'),
(135, 135, '2026', 8.30, 80.00, 'Aprovado'),
(136, 136, '2026', 8.40, 81.00, 'Aprovado'),
(137, 137, '2026', 8.50, 82.00, 'Aprovado'),
(138, 138, '2026', 8.60, 83.00, 'Aprovado'),
(139, 139, '2026', 8.70, 84.00, 'Aprovado'),
(140, 140, '2026', 8.80, 85.00, 'Aprovado'),
(141, 141, '2026', 8.90, 86.00, 'Aprovado'),
(142, 142, '2026', 9.00, 87.00, 'Aprovado'),
(143, 143, '2026', 9.10, 88.00, 'Aprovado'),
(144, 144, '2026', 9.20, 89.00, 'Aprovado'),
(145, 145, '2026', 9.30, 90.00, 'Aprovado'),
(146, 146, '2026', 9.40, 91.00, 'Aprovado'),
(147, 147, '2026', 9.50, 92.00, 'Aprovado'),
(148, 148, '2026', 9.60, 93.00, 'Aprovado'),
(149, 149, '2026', 9.70, 94.00, 'Aprovado'),
(150, 150, '2026', 9.80, 95.00, 'Aprovado'),
(151, 151, '2026', 9.90, 96.00, 'Aprovado'),
(152, 152, '2026', 10.00, 97.00, 'Aprovado'),
(153, 153, '2026', 5.00, 98.00, 'Em recuperação'),
(154, 154, '2026', 5.10, 99.00, 'Em recuperação'),
(155, 155, '2026', 5.20, 100.00, 'Em recuperação'),
(156, 156, '2026', 5.30, 75.00, 'Em recuperação'),
(157, 157, '2026', 5.40, 76.00, 'Em recuperação'),
(158, 158, '2026', 5.50, 77.00, 'Em recuperação'),
(159, 159, '2026', 5.60, 78.00, 'Em recuperação'),
(160, 160, '2026', 5.70, 79.00, 'Em recuperação'),
(161, 161, '2026', 5.80, 80.00, 'Em recuperação'),
(162, 162, '2026', 5.90, 81.00, 'Em recuperação'),
(163, 163, '2026', 6.00, 82.00, 'Aprovado'),
(164, 164, '2026', 6.10, 83.00, 'Aprovado'),
(165, 165, '2026', 6.20, 84.00, 'Aprovado'),
(166, 166, '2026', 6.30, 85.00, 'Aprovado'),
(167, 167, '2026', 6.40, 86.00, 'Aprovado'),
(168, 168, '2026', 6.50, 87.00, 'Aprovado'),
(169, 169, '2026', 6.60, 88.00, 'Aprovado'),
(170, 170, '2026', 6.70, 89.00, 'Aprovado'),
(171, 171, '2026', 6.80, 90.00, 'Aprovado'),
(172, 172, '2026', 6.90, 91.00, 'Aprovado'),
(173, 173, '2026', 7.00, 92.00, 'Aprovado'),
(174, 174, '2026', 7.10, 93.00, 'Aprovado'),
(175, 175, '2026', 7.20, 94.00, 'Aprovado'),
(176, 176, '2026', 7.30, 95.00, 'Aprovado'),
(177, 177, '2026', 7.40, 96.00, 'Aprovado'),
(178, 178, '2026', 7.50, 97.00, 'Aprovado'),
(179, 179, '2026', 7.60, 98.00, 'Aprovado'),
(180, 180, '2026', 7.70, 99.00, 'Aprovado'),
(181, 181, '2026', 7.80, 100.00, 'Aprovado'),
(182, 182, '2026', 7.90, 75.00, 'Aprovado'),
(183, 183, '2026', 8.00, 76.00, 'Aprovado'),
(184, 184, '2026', 8.10, 77.00, 'Aprovado'),
(185, 185, '2026', 8.20, 78.00, 'Aprovado'),
(186, 186, '2026', 8.30, 79.00, 'Aprovado'),
(187, 187, '2026', 8.40, 80.00, 'Aprovado'),
(188, 188, '2026', 8.50, 81.00, 'Aprovado'),
(189, 189, '2026', 8.60, 82.00, 'Aprovado'),
(190, 190, '2026', 8.70, 83.00, 'Aprovado'),
(191, 191, '2026', 8.80, 84.00, 'Aprovado'),
(192, 192, '2026', 8.90, 85.00, 'Aprovado'),
(193, 193, '2026', 9.00, 86.00, 'Aprovado'),
(194, 194, '2026', 9.10, 87.00, 'Aprovado'),
(195, 195, '2026', 9.20, 88.00, 'Aprovado'),
(196, 196, '2026', 9.30, 89.00, 'Aprovado'),
(197, 197, '2026', 9.40, 90.00, 'Aprovado'),
(198, 198, '2026', 9.50, 91.00, 'Aprovado'),
(199, 199, '2026', 9.60, 92.00, 'Aprovado'),
(200, 200, '2026', 9.70, 93.00, 'Aprovado'),
(201, 201, '2026', 9.80, 94.00, 'Aprovado'),
(202, 202, '2026', 9.90, 95.00, 'Aprovado'),
(203, 203, '2026', 10.00, 96.00, 'Aprovado'),
(204, 204, '2026', 5.00, 97.00, 'Em recuperação'),
(205, 205, '2026', 5.10, 98.00, 'Em recuperação'),
(206, 206, '2026', 5.20, 99.00, 'Em recuperação'),
(207, 207, '2026', 5.30, 100.00, 'Em recuperação'),
(208, 208, '2026', 5.40, 75.00, 'Em recuperação'),
(209, 209, '2026', 5.50, 76.00, 'Em recuperação'),
(210, 210, '2026', 5.60, 77.00, 'Em recuperação'),
(211, 211, '2026', 5.70, 78.00, 'Em recuperação'),
(212, 212, '2026', 5.80, 79.00, 'Em recuperação'),
(213, 213, '2026', 5.90, 80.00, 'Em recuperação'),
(214, 214, '2026', 6.00, 81.00, 'Aprovado'),
(215, 215, '2026', 6.10, 82.00, 'Aprovado'),
(216, 216, '2026', 6.20, 83.00, 'Aprovado'),
(217, 217, '2026', 6.30, 84.00, 'Aprovado'),
(218, 218, '2026', 6.40, 85.00, 'Aprovado'),
(219, 219, '2026', 6.50, 86.00, 'Aprovado'),
(220, 220, '2026', 6.60, 87.00, 'Aprovado'),
(221, 221, '2026', 6.70, 88.00, 'Aprovado'),
(222, 222, '2026', 6.80, 89.00, 'Aprovado'),
(223, 223, '2026', 6.90, 90.00, 'Aprovado'),
(224, 224, '2026', 7.00, 91.00, 'Aprovado'),
(225, 225, '2026', 7.10, 92.00, 'Aprovado'),
(226, 226, '2026', 7.20, 93.00, 'Aprovado'),
(227, 227, '2026', 7.30, 94.00, 'Aprovado'),
(228, 228, '2026', 7.40, 95.00, 'Aprovado'),
(229, 229, '2026', 7.50, 96.00, 'Aprovado'),
(230, 230, '2026', 7.60, 97.00, 'Aprovado'),
(231, 231, '2026', 7.70, 98.00, 'Aprovado'),
(232, 232, '2026', 7.80, 99.00, 'Aprovado'),
(233, 233, '2026', 7.90, 100.00, 'Aprovado'),
(234, 234, '2026', 8.00, 75.00, 'Aprovado'),
(235, 235, '2026', 8.10, 76.00, 'Aprovado'),
(236, 236, '2026', 8.20, 77.00, 'Aprovado'),
(237, 237, '2026', 8.30, 78.00, 'Aprovado'),
(238, 238, '2026', 8.40, 79.00, 'Aprovado'),
(239, 239, '2026', 8.50, 80.00, 'Aprovado'),
(240, 240, '2026', 8.60, 81.00, 'Aprovado'),
(241, 241, '2026', 8.70, 82.00, 'Aprovado'),
(242, 242, '2026', 8.80, 83.00, 'Aprovado'),
(243, 243, '2026', 8.90, 84.00, 'Aprovado'),
(244, 244, '2026', 9.00, 85.00, 'Aprovado'),
(245, 245, '2026', 9.10, 86.00, 'Aprovado'),
(246, 246, '2026', 9.20, 87.00, 'Aprovado'),
(247, 247, '2026', 9.30, 88.00, 'Aprovado'),
(248, 248, '2026', 9.40, 89.00, 'Aprovado'),
(249, 249, '2026', 9.50, 90.00, 'Aprovado'),
(250, 250, '2026', 9.60, 91.00, 'Aprovado');

-- --------------------------------------------------------

--
-- Estrutura para tabela `coordenadores`
--

CREATE TABLE `coordenadores` (
  `id_coordenador` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `cpf` char(11) NOT NULL,
  `formacao` varchar(120) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `telefone` varchar(20) DEFAULT NULL,
  `endereco` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `coordenadores`
--

INSERT INTO `coordenadores` (`id_coordenador`, `nome`, `cpf`, `formacao`, `email`, `telefone`, `endereco`) VALUES
(1, 'Coordenador 1', '00000000001', 'Licenciatura em Educação', 'coordenador1@escola.com', '(12) 90000-0001', 'Rua da Escola, 1'),
(2, 'Coordenador 2', '00000000002', 'Licenciatura em Educação', 'coordenador2@escola.com', '(12) 90000-0002', 'Rua da Escola, 2'),
(3, 'Coordenador 3', '00000000003', 'Licenciatura em Educação', 'coordenador3@escola.com', '(12) 90000-0003', 'Rua da Escola, 3'),
(4, 'Coordenador 4', '00000000004', 'Licenciatura em Educação', 'coordenador4@escola.com', '(12) 90000-0004', 'Rua da Escola, 4'),
(5, 'Coordenador 5', '00000000005', 'Licenciatura em Educação', 'coordenador5@escola.com', '(12) 90000-0005', 'Rua da Escola, 5');

-- --------------------------------------------------------

--
-- Estrutura para tabela `cursos`
--

CREATE TABLE `cursos` (
  `id_curso` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `carga_horaria` int(11) NOT NULL,
  `duracao` varchar(50) NOT NULL,
  `descricao` text DEFAULT NULL,
  `id_coordenador` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `cursos`
--

INSERT INTO `cursos` (`id_curso`, `nome`, `carga_horaria`, `duracao`, `descricao`, `id_coordenador`) VALUES
(1, 'Desenvolvimento de Sistemas', 1200, '3 semestres', 'Curso técnico profissionalizante.', 1),
(2, 'Administração', 1000, '3 semestres', 'Curso técnico profissionalizante.', 2),
(3, 'Informática', 1100, '3 semestres', 'Curso técnico profissionalizante.', 3),
(4, 'Contabilidade', 1000, '3 semestres', 'Curso técnico profissionalizante.', 4),
(5, 'Marketing', 900, '3 semestres', 'Curso técnico profissionalizante.', 5);

-- --------------------------------------------------------

--
-- Estrutura para tabela `disciplinas`
--

CREATE TABLE `disciplinas` (
  `id_disciplina` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `carga_horaria` int(11) NOT NULL,
  `id_curso` int(11) NOT NULL,
  `id_professor` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `disciplinas`
--

INSERT INTO `disciplinas` (`id_disciplina`, `nome`, `carga_horaria`, `id_curso`, `id_professor`) VALUES
(1, 'Disciplina 1', 80, 1, 1),
(2, 'Disciplina 2', 80, 1, 2),
(3, 'Disciplina 3', 80, 1, 3),
(4, 'Disciplina 4', 80, 1, 4),
(5, 'Disciplina 5', 80, 1, 5),
(6, 'Disciplina 6', 80, 1, 6),
(7, 'Disciplina 7', 80, 1, 7),
(8, 'Disciplina 8', 80, 1, 8),
(9, 'Disciplina 9', 80, 1, 9),
(10, 'Disciplina 10', 80, 1, 10),
(11, 'Disciplina 11', 80, 2, 11),
(12, 'Disciplina 12', 80, 2, 12),
(13, 'Disciplina 13', 80, 2, 13),
(14, 'Disciplina 14', 80, 2, 14),
(15, 'Disciplina 15', 80, 2, 15),
(16, 'Disciplina 16', 80, 2, 16),
(17, 'Disciplina 17', 80, 2, 17),
(18, 'Disciplina 18', 80, 2, 18),
(19, 'Disciplina 19', 80, 2, 19),
(20, 'Disciplina 20', 80, 2, 20),
(21, 'Disciplina 21', 80, 3, 1),
(22, 'Disciplina 22', 80, 3, 2),
(23, 'Disciplina 23', 80, 3, 3),
(24, 'Disciplina 24', 80, 3, 4),
(25, 'Disciplina 25', 80, 3, 5),
(26, 'Disciplina 26', 80, 3, 6),
(27, 'Disciplina 27', 80, 3, 7),
(28, 'Disciplina 28', 80, 3, 8),
(29, 'Disciplina 29', 80, 3, 9),
(30, 'Disciplina 30', 80, 3, 10),
(31, 'Disciplina 31', 80, 4, 11),
(32, 'Disciplina 32', 80, 4, 12),
(33, 'Disciplina 33', 80, 4, 13),
(34, 'Disciplina 34', 80, 4, 14),
(35, 'Disciplina 35', 80, 4, 15),
(36, 'Disciplina 36', 80, 4, 16),
(37, 'Disciplina 37', 80, 4, 17),
(38, 'Disciplina 38', 80, 4, 18),
(39, 'Disciplina 39', 80, 4, 19),
(40, 'Disciplina 40', 80, 4, 20),
(41, 'Disciplina 41', 80, 5, 1),
(42, 'Disciplina 42', 80, 5, 2),
(43, 'Disciplina 43', 80, 5, 3),
(44, 'Disciplina 44', 80, 5, 4),
(45, 'Disciplina 45', 80, 5, 5),
(46, 'Disciplina 46', 80, 5, 6),
(47, 'Disciplina 47', 80, 5, 7),
(48, 'Disciplina 48', 80, 5, 8),
(49, 'Disciplina 49', 80, 5, 9),
(50, 'Disciplina 50', 80, 5, 10);

-- --------------------------------------------------------

--
-- Estrutura para tabela `frequencias`
--

CREATE TABLE `frequencias` (
  `id_frequencia` int(11) NOT NULL,
  `id_aluno` int(11) NOT NULL,
  `id_turma` int(11) NOT NULL,
  `ano_letivo` year(4) NOT NULL,
  `percentual` decimal(5,2) NOT NULL,
  `faltas` int(11) NOT NULL,
  `presencas` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `frequencias`
--

INSERT INTO `frequencias` (`id_frequencia`, `id_aluno`, `id_turma`, `ano_letivo`, `percentual`, `faltas`, `presencas`) VALUES
(1, 1, 1, '2026', 75.50, 49, 151),
(2, 2, 2, '2026', 76.00, 48, 152),
(3, 3, 3, '2026', 76.50, 47, 153),
(4, 4, 4, '2026', 77.00, 46, 154),
(5, 5, 5, '2026', 77.50, 45, 155),
(6, 6, 1, '2026', 78.00, 44, 156),
(7, 7, 2, '2026', 78.50, 43, 157),
(8, 8, 3, '2026', 79.00, 42, 158),
(9, 9, 4, '2026', 79.50, 41, 159),
(10, 10, 5, '2026', 80.00, 40, 160),
(11, 11, 1, '2026', 80.50, 39, 161),
(12, 12, 2, '2026', 81.00, 38, 162),
(13, 13, 3, '2026', 81.50, 37, 163),
(14, 14, 4, '2026', 82.00, 36, 164),
(15, 15, 5, '2026', 82.50, 35, 165),
(16, 16, 1, '2026', 83.00, 34, 166),
(17, 17, 2, '2026', 83.50, 33, 167),
(18, 18, 3, '2026', 84.00, 32, 168),
(19, 19, 4, '2026', 84.50, 31, 169),
(20, 20, 5, '2026', 85.00, 30, 170),
(21, 21, 1, '2026', 85.50, 29, 171),
(22, 22, 2, '2026', 86.00, 28, 172),
(23, 23, 3, '2026', 86.50, 27, 173),
(24, 24, 4, '2026', 87.00, 26, 174),
(25, 25, 5, '2026', 87.50, 25, 175),
(26, 26, 1, '2026', 88.00, 24, 176),
(27, 27, 2, '2026', 88.50, 23, 177),
(28, 28, 3, '2026', 89.00, 22, 178),
(29, 29, 4, '2026', 89.50, 21, 179),
(30, 30, 5, '2026', 75.00, 50, 150),
(31, 31, 1, '2026', 75.50, 49, 151),
(32, 32, 2, '2026', 76.00, 48, 152),
(33, 33, 3, '2026', 76.50, 47, 153),
(34, 34, 4, '2026', 77.00, 46, 154),
(35, 35, 5, '2026', 77.50, 45, 155),
(36, 36, 1, '2026', 78.00, 44, 156),
(37, 37, 2, '2026', 78.50, 43, 157),
(38, 38, 3, '2026', 79.00, 42, 158),
(39, 39, 4, '2026', 79.50, 41, 159),
(40, 40, 5, '2026', 80.00, 40, 160),
(41, 41, 1, '2026', 80.50, 39, 161),
(42, 42, 2, '2026', 81.00, 38, 162),
(43, 43, 3, '2026', 81.50, 37, 163),
(44, 44, 4, '2026', 82.00, 36, 164),
(45, 45, 5, '2026', 82.50, 35, 165),
(46, 46, 1, '2026', 83.00, 34, 166),
(47, 47, 2, '2026', 83.50, 33, 167),
(48, 48, 3, '2026', 84.00, 32, 168),
(49, 49, 4, '2026', 84.50, 31, 169),
(50, 50, 5, '2026', 85.00, 30, 170),
(51, 51, 1, '2026', 85.50, 29, 171),
(52, 52, 2, '2026', 86.00, 28, 172),
(53, 53, 3, '2026', 86.50, 27, 173),
(54, 54, 4, '2026', 87.00, 26, 174),
(55, 55, 5, '2026', 87.50, 25, 175),
(56, 56, 1, '2026', 88.00, 24, 176),
(57, 57, 2, '2026', 88.50, 23, 177),
(58, 58, 3, '2026', 89.00, 22, 178),
(59, 59, 4, '2026', 89.50, 21, 179),
(60, 60, 5, '2026', 75.00, 50, 150),
(61, 61, 1, '2026', 75.50, 49, 151),
(62, 62, 2, '2026', 76.00, 48, 152),
(63, 63, 3, '2026', 76.50, 47, 153),
(64, 64, 4, '2026', 77.00, 46, 154),
(65, 65, 5, '2026', 77.50, 45, 155),
(66, 66, 1, '2026', 78.00, 44, 156),
(67, 67, 2, '2026', 78.50, 43, 157),
(68, 68, 3, '2026', 79.00, 42, 158),
(69, 69, 4, '2026', 79.50, 41, 159),
(70, 70, 5, '2026', 80.00, 40, 160),
(71, 71, 1, '2026', 80.50, 39, 161),
(72, 72, 2, '2026', 81.00, 38, 162),
(73, 73, 3, '2026', 81.50, 37, 163),
(74, 74, 4, '2026', 82.00, 36, 164),
(75, 75, 5, '2026', 82.50, 35, 165),
(76, 76, 1, '2026', 83.00, 34, 166),
(77, 77, 2, '2026', 83.50, 33, 167),
(78, 78, 3, '2026', 84.00, 32, 168),
(79, 79, 4, '2026', 84.50, 31, 169),
(80, 80, 5, '2026', 85.00, 30, 170),
(81, 81, 1, '2026', 85.50, 29, 171),
(82, 82, 2, '2026', 86.00, 28, 172),
(83, 83, 3, '2026', 86.50, 27, 173),
(84, 84, 4, '2026', 87.00, 26, 174),
(85, 85, 5, '2026', 87.50, 25, 175),
(86, 86, 1, '2026', 88.00, 24, 176),
(87, 87, 2, '2026', 88.50, 23, 177),
(88, 88, 3, '2026', 89.00, 22, 178),
(89, 89, 4, '2026', 89.50, 21, 179),
(90, 90, 5, '2026', 75.00, 50, 150),
(91, 91, 1, '2026', 75.50, 49, 151),
(92, 92, 2, '2026', 76.00, 48, 152),
(93, 93, 3, '2026', 76.50, 47, 153),
(94, 94, 4, '2026', 77.00, 46, 154),
(95, 95, 5, '2026', 77.50, 45, 155),
(96, 96, 1, '2026', 78.00, 44, 156),
(97, 97, 2, '2026', 78.50, 43, 157),
(98, 98, 3, '2026', 79.00, 42, 158),
(99, 99, 4, '2026', 79.50, 41, 159),
(100, 100, 5, '2026', 80.00, 40, 160),
(101, 101, 1, '2026', 80.50, 39, 161),
(102, 102, 2, '2026', 81.00, 38, 162),
(103, 103, 3, '2026', 81.50, 37, 163),
(104, 104, 4, '2026', 82.00, 36, 164),
(105, 105, 5, '2026', 82.50, 35, 165),
(106, 106, 1, '2026', 83.00, 34, 166),
(107, 107, 2, '2026', 83.50, 33, 167),
(108, 108, 3, '2026', 84.00, 32, 168),
(109, 109, 4, '2026', 84.50, 31, 169),
(110, 110, 5, '2026', 85.00, 30, 170),
(111, 111, 1, '2026', 85.50, 29, 171),
(112, 112, 2, '2026', 86.00, 28, 172),
(113, 113, 3, '2026', 86.50, 27, 173),
(114, 114, 4, '2026', 87.00, 26, 174),
(115, 115, 5, '2026', 87.50, 25, 175),
(116, 116, 1, '2026', 88.00, 24, 176),
(117, 117, 2, '2026', 88.50, 23, 177),
(118, 118, 3, '2026', 89.00, 22, 178),
(119, 119, 4, '2026', 89.50, 21, 179),
(120, 120, 5, '2026', 75.00, 50, 150),
(121, 121, 1, '2026', 75.50, 49, 151),
(122, 122, 2, '2026', 76.00, 48, 152),
(123, 123, 3, '2026', 76.50, 47, 153),
(124, 124, 4, '2026', 77.00, 46, 154),
(125, 125, 5, '2026', 77.50, 45, 155),
(126, 126, 1, '2026', 78.00, 44, 156),
(127, 127, 2, '2026', 78.50, 43, 157),
(128, 128, 3, '2026', 79.00, 42, 158),
(129, 129, 4, '2026', 79.50, 41, 159),
(130, 130, 5, '2026', 80.00, 40, 160),
(131, 131, 1, '2026', 80.50, 39, 161),
(132, 132, 2, '2026', 81.00, 38, 162),
(133, 133, 3, '2026', 81.50, 37, 163),
(134, 134, 4, '2026', 82.00, 36, 164),
(135, 135, 5, '2026', 82.50, 35, 165),
(136, 136, 1, '2026', 83.00, 34, 166),
(137, 137, 2, '2026', 83.50, 33, 167),
(138, 138, 3, '2026', 84.00, 32, 168),
(139, 139, 4, '2026', 84.50, 31, 169),
(140, 140, 5, '2026', 85.00, 30, 170),
(141, 141, 1, '2026', 85.50, 29, 171),
(142, 142, 2, '2026', 86.00, 28, 172),
(143, 143, 3, '2026', 86.50, 27, 173),
(144, 144, 4, '2026', 87.00, 26, 174),
(145, 145, 5, '2026', 87.50, 25, 175),
(146, 146, 1, '2026', 88.00, 24, 176),
(147, 147, 2, '2026', 88.50, 23, 177),
(148, 148, 3, '2026', 89.00, 22, 178),
(149, 149, 4, '2026', 89.50, 21, 179),
(150, 150, 5, '2026', 75.00, 50, 150),
(151, 151, 1, '2026', 75.50, 49, 151),
(152, 152, 2, '2026', 76.00, 48, 152),
(153, 153, 3, '2026', 76.50, 47, 153),
(154, 154, 4, '2026', 77.00, 46, 154),
(155, 155, 5, '2026', 77.50, 45, 155),
(156, 156, 1, '2026', 78.00, 44, 156),
(157, 157, 2, '2026', 78.50, 43, 157),
(158, 158, 3, '2026', 79.00, 42, 158),
(159, 159, 4, '2026', 79.50, 41, 159),
(160, 160, 5, '2026', 80.00, 40, 160),
(161, 161, 1, '2026', 80.50, 39, 161),
(162, 162, 2, '2026', 81.00, 38, 162),
(163, 163, 3, '2026', 81.50, 37, 163),
(164, 164, 4, '2026', 82.00, 36, 164),
(165, 165, 5, '2026', 82.50, 35, 165),
(166, 166, 1, '2026', 83.00, 34, 166),
(167, 167, 2, '2026', 83.50, 33, 167),
(168, 168, 3, '2026', 84.00, 32, 168),
(169, 169, 4, '2026', 84.50, 31, 169),
(170, 170, 5, '2026', 85.00, 30, 170),
(171, 171, 1, '2026', 85.50, 29, 171),
(172, 172, 2, '2026', 86.00, 28, 172),
(173, 173, 3, '2026', 86.50, 27, 173),
(174, 174, 4, '2026', 87.00, 26, 174),
(175, 175, 5, '2026', 87.50, 25, 175),
(176, 176, 1, '2026', 88.00, 24, 176),
(177, 177, 2, '2026', 88.50, 23, 177),
(178, 178, 3, '2026', 89.00, 22, 178),
(179, 179, 4, '2026', 89.50, 21, 179),
(180, 180, 5, '2026', 75.00, 50, 150),
(181, 181, 1, '2026', 75.50, 49, 151),
(182, 182, 2, '2026', 76.00, 48, 152),
(183, 183, 3, '2026', 76.50, 47, 153),
(184, 184, 4, '2026', 77.00, 46, 154),
(185, 185, 5, '2026', 77.50, 45, 155),
(186, 186, 1, '2026', 78.00, 44, 156),
(187, 187, 2, '2026', 78.50, 43, 157),
(188, 188, 3, '2026', 79.00, 42, 158),
(189, 189, 4, '2026', 79.50, 41, 159),
(190, 190, 5, '2026', 80.00, 40, 160),
(191, 191, 1, '2026', 80.50, 39, 161),
(192, 192, 2, '2026', 81.00, 38, 162),
(193, 193, 3, '2026', 81.50, 37, 163),
(194, 194, 4, '2026', 82.00, 36, 164),
(195, 195, 5, '2026', 82.50, 35, 165),
(196, 196, 1, '2026', 83.00, 34, 166),
(197, 197, 2, '2026', 83.50, 33, 167),
(198, 198, 3, '2026', 84.00, 32, 168),
(199, 199, 4, '2026', 84.50, 31, 169),
(200, 200, 5, '2026', 85.00, 30, 170),
(201, 201, 1, '2026', 85.50, 29, 171),
(202, 202, 2, '2026', 86.00, 28, 172),
(203, 203, 3, '2026', 86.50, 27, 173),
(204, 204, 4, '2026', 87.00, 26, 174),
(205, 205, 5, '2026', 87.50, 25, 175),
(206, 206, 1, '2026', 88.00, 24, 176),
(207, 207, 2, '2026', 88.50, 23, 177),
(208, 208, 3, '2026', 89.00, 22, 178),
(209, 209, 4, '2026', 89.50, 21, 179),
(210, 210, 5, '2026', 75.00, 50, 150),
(211, 211, 1, '2026', 75.50, 49, 151),
(212, 212, 2, '2026', 76.00, 48, 152),
(213, 213, 3, '2026', 76.50, 47, 153),
(214, 214, 4, '2026', 77.00, 46, 154),
(215, 215, 5, '2026', 77.50, 45, 155),
(216, 216, 1, '2026', 78.00, 44, 156),
(217, 217, 2, '2026', 78.50, 43, 157),
(218, 218, 3, '2026', 79.00, 42, 158),
(219, 219, 4, '2026', 79.50, 41, 159),
(220, 220, 5, '2026', 80.00, 40, 160),
(221, 221, 1, '2026', 80.50, 39, 161),
(222, 222, 2, '2026', 81.00, 38, 162),
(223, 223, 3, '2026', 81.50, 37, 163),
(224, 224, 4, '2026', 82.00, 36, 164),
(225, 225, 5, '2026', 82.50, 35, 165),
(226, 226, 1, '2026', 83.00, 34, 166),
(227, 227, 2, '2026', 83.50, 33, 167),
(228, 228, 3, '2026', 84.00, 32, 168),
(229, 229, 4, '2026', 84.50, 31, 169),
(230, 230, 5, '2026', 85.00, 30, 170),
(231, 231, 1, '2026', 85.50, 29, 171),
(232, 232, 2, '2026', 86.00, 28, 172),
(233, 233, 3, '2026', 86.50, 27, 173),
(234, 234, 4, '2026', 87.00, 26, 174),
(235, 235, 5, '2026', 87.50, 25, 175),
(236, 236, 1, '2026', 88.00, 24, 176),
(237, 237, 2, '2026', 88.50, 23, 177),
(238, 238, 3, '2026', 89.00, 22, 178),
(239, 239, 4, '2026', 89.50, 21, 179),
(240, 240, 5, '2026', 75.00, 50, 150),
(241, 241, 1, '2026', 75.50, 49, 151),
(242, 242, 2, '2026', 76.00, 48, 152),
(243, 243, 3, '2026', 76.50, 47, 153),
(244, 244, 4, '2026', 77.00, 46, 154),
(245, 245, 5, '2026', 77.50, 45, 155),
(246, 246, 1, '2026', 78.00, 44, 156),
(247, 247, 2, '2026', 78.50, 43, 157),
(248, 248, 3, '2026', 79.00, 42, 158),
(249, 249, 4, '2026', 79.50, 41, 159),
(250, 250, 5, '2026', 80.00, 40, 160);

-- --------------------------------------------------------

--
-- Estrutura para tabela `matriculas`
--

CREATE TABLE `matriculas` (
  `id_matricula` int(11) NOT NULL,
  `id_aluno` int(11) NOT NULL,
  `id_turma` int(11) NOT NULL,
  `data_matricula` date NOT NULL,
  `situacao` enum('Ativa','Trancada','Concluída','Cancelada') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `matriculas`
--

INSERT INTO `matriculas` (`id_matricula`, `id_aluno`, `id_turma`, `data_matricula`, `situacao`) VALUES
(1, 1, 1, '2026-02-01', 'Ativa'),
(2, 2, 2, '2026-02-02', 'Ativa'),
(3, 3, 3, '2026-02-03', 'Ativa'),
(4, 4, 4, '2026-02-04', 'Ativa'),
(5, 5, 5, '2026-02-05', 'Ativa'),
(6, 6, 1, '2026-02-06', 'Ativa'),
(7, 7, 2, '2026-02-07', 'Ativa'),
(8, 8, 3, '2026-02-08', 'Ativa'),
(9, 9, 4, '2026-02-09', 'Ativa'),
(10, 10, 5, '2026-02-10', 'Ativa'),
(11, 11, 1, '2026-02-11', 'Ativa'),
(12, 12, 2, '2026-02-12', 'Ativa'),
(13, 13, 3, '2026-02-13', 'Ativa'),
(14, 14, 4, '2026-02-14', 'Ativa'),
(15, 15, 5, '2026-02-15', 'Ativa'),
(16, 16, 1, '2026-02-16', 'Ativa'),
(17, 17, 2, '2026-02-17', 'Ativa'),
(18, 18, 3, '2026-02-18', 'Ativa'),
(19, 19, 4, '2026-02-19', 'Ativa'),
(20, 20, 5, '2026-02-20', 'Concluída'),
(21, 21, 1, '2026-02-21', 'Ativa'),
(22, 22, 2, '2026-02-22', 'Ativa'),
(23, 23, 3, '2026-02-23', 'Ativa'),
(24, 24, 4, '2026-02-24', 'Ativa'),
(25, 25, 5, '2026-02-25', 'Ativa'),
(26, 26, 1, '2026-02-26', 'Ativa'),
(27, 27, 2, '2026-02-27', 'Ativa'),
(28, 28, 3, '2026-02-01', 'Ativa'),
(29, 29, 4, '2026-02-02', 'Ativa'),
(30, 30, 5, '2026-02-03', 'Ativa'),
(31, 31, 1, '2026-02-04', 'Ativa'),
(32, 32, 2, '2026-02-05', 'Ativa'),
(33, 33, 3, '2026-02-06', 'Ativa'),
(34, 34, 4, '2026-02-07', 'Ativa'),
(35, 35, 5, '2026-02-08', 'Ativa'),
(36, 36, 1, '2026-02-09', 'Ativa'),
(37, 37, 2, '2026-02-10', 'Ativa'),
(38, 38, 3, '2026-02-11', 'Ativa'),
(39, 39, 4, '2026-02-12', 'Ativa'),
(40, 40, 5, '2026-02-13', 'Concluída'),
(41, 41, 1, '2026-02-14', 'Ativa'),
(42, 42, 2, '2026-02-15', 'Ativa'),
(43, 43, 3, '2026-02-16', 'Ativa'),
(44, 44, 4, '2026-02-17', 'Ativa'),
(45, 45, 5, '2026-02-18', 'Ativa'),
(46, 46, 1, '2026-02-19', 'Ativa'),
(47, 47, 2, '2026-02-20', 'Ativa'),
(48, 48, 3, '2026-02-21', 'Ativa'),
(49, 49, 4, '2026-02-22', 'Ativa'),
(50, 50, 5, '2026-02-23', 'Ativa'),
(51, 51, 1, '2026-02-24', 'Ativa'),
(52, 52, 2, '2026-02-25', 'Ativa'),
(53, 53, 3, '2026-02-26', 'Ativa'),
(54, 54, 4, '2026-02-27', 'Ativa'),
(55, 55, 5, '2026-02-01', 'Ativa'),
(56, 56, 1, '2026-02-02', 'Ativa'),
(57, 57, 2, '2026-02-03', 'Ativa'),
(58, 58, 3, '2026-02-04', 'Ativa'),
(59, 59, 4, '2026-02-05', 'Ativa'),
(60, 60, 5, '2026-02-06', 'Concluída'),
(61, 61, 1, '2026-02-07', 'Ativa'),
(62, 62, 2, '2026-02-08', 'Ativa'),
(63, 63, 3, '2026-02-09', 'Ativa'),
(64, 64, 4, '2026-02-10', 'Ativa'),
(65, 65, 5, '2026-02-11', 'Ativa'),
(66, 66, 1, '2026-02-12', 'Ativa'),
(67, 67, 2, '2026-02-13', 'Ativa'),
(68, 68, 3, '2026-02-14', 'Ativa'),
(69, 69, 4, '2026-02-15', 'Ativa'),
(70, 70, 5, '2026-02-16', 'Ativa'),
(71, 71, 1, '2026-02-17', 'Ativa'),
(72, 72, 2, '2026-02-18', 'Ativa'),
(73, 73, 3, '2026-02-19', 'Ativa'),
(74, 74, 4, '2026-02-20', 'Ativa'),
(75, 75, 5, '2026-02-21', 'Ativa'),
(76, 76, 1, '2026-02-22', 'Ativa'),
(77, 77, 2, '2026-02-23', 'Ativa'),
(78, 78, 3, '2026-02-24', 'Ativa'),
(79, 79, 4, '2026-02-25', 'Ativa'),
(80, 80, 5, '2026-02-26', 'Concluída'),
(81, 81, 1, '2026-02-27', 'Ativa'),
(82, 82, 2, '2026-02-01', 'Ativa'),
(83, 83, 3, '2026-02-02', 'Ativa'),
(84, 84, 4, '2026-02-03', 'Ativa'),
(85, 85, 5, '2026-02-04', 'Ativa'),
(86, 86, 1, '2026-02-05', 'Ativa'),
(87, 87, 2, '2026-02-06', 'Ativa'),
(88, 88, 3, '2026-02-07', 'Ativa'),
(89, 89, 4, '2026-02-08', 'Ativa'),
(90, 90, 5, '2026-02-09', 'Ativa'),
(91, 91, 1, '2026-02-10', 'Ativa'),
(92, 92, 2, '2026-02-11', 'Ativa'),
(93, 93, 3, '2026-02-12', 'Ativa'),
(94, 94, 4, '2026-02-13', 'Ativa'),
(95, 95, 5, '2026-02-14', 'Ativa'),
(96, 96, 1, '2026-02-15', 'Ativa'),
(97, 97, 2, '2026-02-16', 'Ativa'),
(98, 98, 3, '2026-02-17', 'Ativa'),
(99, 99, 4, '2026-02-18', 'Ativa'),
(100, 100, 5, '2026-02-19', 'Concluída'),
(101, 101, 1, '2026-02-20', 'Ativa'),
(102, 102, 2, '2026-02-21', 'Ativa'),
(103, 103, 3, '2026-02-22', 'Ativa'),
(104, 104, 4, '2026-02-23', 'Ativa'),
(105, 105, 5, '2026-02-24', 'Ativa'),
(106, 106, 1, '2026-02-25', 'Ativa'),
(107, 107, 2, '2026-02-26', 'Ativa'),
(108, 108, 3, '2026-02-27', 'Ativa'),
(109, 109, 4, '2026-02-01', 'Ativa'),
(110, 110, 5, '2026-02-02', 'Ativa'),
(111, 111, 1, '2026-02-03', 'Ativa'),
(112, 112, 2, '2026-02-04', 'Ativa'),
(113, 113, 3, '2026-02-05', 'Ativa'),
(114, 114, 4, '2026-02-06', 'Ativa'),
(115, 115, 5, '2026-02-07', 'Ativa'),
(116, 116, 1, '2026-02-08', 'Ativa'),
(117, 117, 2, '2026-02-09', 'Ativa'),
(118, 118, 3, '2026-02-10', 'Ativa'),
(119, 119, 4, '2026-02-11', 'Ativa'),
(120, 120, 5, '2026-02-12', 'Concluída'),
(121, 121, 1, '2026-02-13', 'Ativa'),
(122, 122, 2, '2026-02-14', 'Ativa'),
(123, 123, 3, '2026-02-15', 'Ativa'),
(124, 124, 4, '2026-02-16', 'Ativa'),
(125, 125, 5, '2026-02-17', 'Ativa'),
(126, 126, 1, '2026-02-18', 'Ativa'),
(127, 127, 2, '2026-02-19', 'Ativa'),
(128, 128, 3, '2026-02-20', 'Ativa'),
(129, 129, 4, '2026-02-21', 'Ativa'),
(130, 130, 5, '2026-02-22', 'Ativa'),
(131, 131, 1, '2026-02-23', 'Ativa'),
(132, 132, 2, '2026-02-24', 'Ativa'),
(133, 133, 3, '2026-02-25', 'Ativa'),
(134, 134, 4, '2026-02-26', 'Ativa'),
(135, 135, 5, '2026-02-27', 'Ativa'),
(136, 136, 1, '2026-02-01', 'Ativa'),
(137, 137, 2, '2026-02-02', 'Ativa'),
(138, 138, 3, '2026-02-03', 'Ativa'),
(139, 139, 4, '2026-02-04', 'Ativa'),
(140, 140, 5, '2026-02-05', 'Concluída'),
(141, 141, 1, '2026-02-06', 'Ativa'),
(142, 142, 2, '2026-02-07', 'Ativa'),
(143, 143, 3, '2026-02-08', 'Ativa'),
(144, 144, 4, '2026-02-09', 'Ativa'),
(145, 145, 5, '2026-02-10', 'Ativa'),
(146, 146, 1, '2026-02-11', 'Ativa'),
(147, 147, 2, '2026-02-12', 'Ativa'),
(148, 148, 3, '2026-02-13', 'Ativa'),
(149, 149, 4, '2026-02-14', 'Ativa'),
(150, 150, 5, '2026-02-15', 'Ativa'),
(151, 151, 1, '2026-02-16', 'Ativa'),
(152, 152, 2, '2026-02-17', 'Ativa'),
(153, 153, 3, '2026-02-18', 'Ativa'),
(154, 154, 4, '2026-02-19', 'Ativa'),
(155, 155, 5, '2026-02-20', 'Ativa'),
(156, 156, 1, '2026-02-21', 'Ativa'),
(157, 157, 2, '2026-02-22', 'Ativa'),
(158, 158, 3, '2026-02-23', 'Ativa'),
(159, 159, 4, '2026-02-24', 'Ativa'),
(160, 160, 5, '2026-02-25', 'Concluída'),
(161, 161, 1, '2026-02-26', 'Ativa'),
(162, 162, 2, '2026-02-27', 'Ativa'),
(163, 163, 3, '2026-02-01', 'Ativa'),
(164, 164, 4, '2026-02-02', 'Ativa'),
(165, 165, 5, '2026-02-03', 'Ativa'),
(166, 166, 1, '2026-02-04', 'Ativa'),
(167, 167, 2, '2026-02-05', 'Ativa'),
(168, 168, 3, '2026-02-06', 'Ativa'),
(169, 169, 4, '2026-02-07', 'Ativa'),
(170, 170, 5, '2026-02-08', 'Ativa'),
(171, 171, 1, '2026-02-09', 'Ativa'),
(172, 172, 2, '2026-02-10', 'Ativa'),
(173, 173, 3, '2026-02-11', 'Ativa'),
(174, 174, 4, '2026-02-12', 'Ativa'),
(175, 175, 5, '2026-02-13', 'Ativa'),
(176, 176, 1, '2026-02-14', 'Ativa'),
(177, 177, 2, '2026-02-15', 'Ativa'),
(178, 178, 3, '2026-02-16', 'Ativa'),
(179, 179, 4, '2026-02-17', 'Ativa'),
(180, 180, 5, '2026-02-18', 'Concluída'),
(181, 181, 1, '2026-02-19', 'Ativa'),
(182, 182, 2, '2026-02-20', 'Ativa'),
(183, 183, 3, '2026-02-21', 'Ativa'),
(184, 184, 4, '2026-02-22', 'Ativa'),
(185, 185, 5, '2026-02-23', 'Ativa'),
(186, 186, 1, '2026-02-24', 'Ativa'),
(187, 187, 2, '2026-02-25', 'Ativa'),
(188, 188, 3, '2026-02-26', 'Ativa'),
(189, 189, 4, '2026-02-27', 'Ativa'),
(190, 190, 5, '2026-02-01', 'Ativa'),
(191, 191, 1, '2026-02-02', 'Ativa'),
(192, 192, 2, '2026-02-03', 'Ativa'),
(193, 193, 3, '2026-02-04', 'Ativa'),
(194, 194, 4, '2026-02-05', 'Ativa'),
(195, 195, 5, '2026-02-06', 'Ativa'),
(196, 196, 1, '2026-02-07', 'Ativa'),
(197, 197, 2, '2026-02-08', 'Ativa'),
(198, 198, 3, '2026-02-09', 'Ativa'),
(199, 199, 4, '2026-02-10', 'Ativa'),
(200, 200, 5, '2026-02-11', 'Concluída'),
(201, 201, 1, '2026-02-12', 'Ativa'),
(202, 202, 2, '2026-02-13', 'Ativa'),
(203, 203, 3, '2026-02-14', 'Ativa'),
(204, 204, 4, '2026-02-15', 'Ativa'),
(205, 205, 5, '2026-02-16', 'Ativa'),
(206, 206, 1, '2026-02-17', 'Ativa'),
(207, 207, 2, '2026-02-18', 'Ativa'),
(208, 208, 3, '2026-02-19', 'Ativa'),
(209, 209, 4, '2026-02-20', 'Ativa'),
(210, 210, 5, '2026-02-21', 'Ativa'),
(211, 211, 1, '2026-02-22', 'Ativa'),
(212, 212, 2, '2026-02-23', 'Ativa'),
(213, 213, 3, '2026-02-24', 'Ativa'),
(214, 214, 4, '2026-02-25', 'Ativa'),
(215, 215, 5, '2026-02-26', 'Ativa'),
(216, 216, 1, '2026-02-27', 'Ativa'),
(217, 217, 2, '2026-02-01', 'Ativa'),
(218, 218, 3, '2026-02-02', 'Ativa'),
(219, 219, 4, '2026-02-03', 'Ativa'),
(220, 220, 5, '2026-02-04', 'Concluída'),
(221, 221, 1, '2026-02-05', 'Ativa'),
(222, 222, 2, '2026-02-06', 'Ativa'),
(223, 223, 3, '2026-02-07', 'Ativa'),
(224, 224, 4, '2026-02-08', 'Ativa'),
(225, 225, 5, '2026-02-09', 'Ativa'),
(226, 226, 1, '2026-02-10', 'Ativa'),
(227, 227, 2, '2026-02-11', 'Ativa'),
(228, 228, 3, '2026-02-12', 'Ativa'),
(229, 229, 4, '2026-02-13', 'Ativa'),
(230, 230, 5, '2026-02-14', 'Ativa'),
(231, 231, 1, '2026-02-15', 'Ativa'),
(232, 232, 2, '2026-02-16', 'Ativa'),
(233, 233, 3, '2026-02-17', 'Ativa'),
(234, 234, 4, '2026-02-18', 'Ativa'),
(235, 235, 5, '2026-02-19', 'Ativa'),
(236, 236, 1, '2026-02-20', 'Ativa'),
(237, 237, 2, '2026-02-21', 'Ativa'),
(238, 238, 3, '2026-02-22', 'Ativa'),
(239, 239, 4, '2026-02-23', 'Ativa'),
(240, 240, 5, '2026-02-24', 'Concluída'),
(241, 241, 1, '2026-02-25', 'Ativa'),
(242, 242, 2, '2026-02-26', 'Ativa'),
(243, 243, 3, '2026-02-27', 'Ativa'),
(244, 244, 4, '2026-02-01', 'Ativa'),
(245, 245, 5, '2026-02-02', 'Ativa'),
(246, 246, 1, '2026-02-03', 'Ativa'),
(247, 247, 2, '2026-02-04', 'Ativa'),
(248, 248, 3, '2026-02-05', 'Ativa'),
(249, 249, 4, '2026-02-06', 'Ativa'),
(250, 250, 5, '2026-02-07', 'Ativa');

-- --------------------------------------------------------

--
-- Estrutura para tabela `professores`
--

CREATE TABLE `professores` (
  `id_professor` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `cpf` char(11) NOT NULL,
  `formacao` varchar(120) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `telefone` varchar(20) DEFAULT NULL,
  `endereco` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `professores`
--

INSERT INTO `professores` (`id_professor`, `nome`, `cpf`, `formacao`, `email`, `telefone`, `endereco`) VALUES
(1, 'Professor 1', '00000001001', 'Licenciatura em área específica', 'professor1@escola.com', '(12) 91000-0001', 'Rua dos Professores, 1'),
(2, 'Professor 2', '00000001002', 'Licenciatura em área específica', 'professor2@escola.com', '(12) 91000-0002', 'Rua dos Professores, 2'),
(3, 'Professor 3', '00000001003', 'Licenciatura em área específica', 'professor3@escola.com', '(12) 91000-0003', 'Rua dos Professores, 3'),
(4, 'Professor 4', '00000001004', 'Licenciatura em área específica', 'professor4@escola.com', '(12) 91000-0004', 'Rua dos Professores, 4'),
(5, 'Professor 5', '00000001005', 'Licenciatura em área específica', 'professor5@escola.com', '(12) 91000-0005', 'Rua dos Professores, 5'),
(6, 'Professor 6', '00000001006', 'Licenciatura em área específica', 'professor6@escola.com', '(12) 91000-0006', 'Rua dos Professores, 6'),
(7, 'Professor 7', '00000001007', 'Licenciatura em área específica', 'professor7@escola.com', '(12) 91000-0007', 'Rua dos Professores, 7'),
(8, 'Professor 8', '00000001008', 'Licenciatura em área específica', 'professor8@escola.com', '(12) 91000-0008', 'Rua dos Professores, 8'),
(9, 'Professor 9', '00000001009', 'Licenciatura em área específica', 'professor9@escola.com', '(12) 91000-0009', 'Rua dos Professores, 9'),
(10, 'Professor 10', '00000001010', 'Licenciatura em área específica', 'professor10@escola.com', '(12) 91000-0010', 'Rua dos Professores, 10'),
(11, 'Professor 11', '00000001011', 'Licenciatura em área específica', 'professor11@escola.com', '(12) 91000-0011', 'Rua dos Professores, 11'),
(12, 'Professor 12', '00000001012', 'Licenciatura em área específica', 'professor12@escola.com', '(12) 91000-0012', 'Rua dos Professores, 12'),
(13, 'Professor 13', '00000001013', 'Licenciatura em área específica', 'professor13@escola.com', '(12) 91000-0013', 'Rua dos Professores, 13'),
(14, 'Professor 14', '00000001014', 'Licenciatura em área específica', 'professor14@escola.com', '(12) 91000-0014', 'Rua dos Professores, 14'),
(15, 'Professor 15', '00000001015', 'Licenciatura em área específica', 'professor15@escola.com', '(12) 91000-0015', 'Rua dos Professores, 15'),
(16, 'Professor 16', '00000001016', 'Licenciatura em área específica', 'professor16@escola.com', '(12) 91000-0016', 'Rua dos Professores, 16'),
(17, 'Professor 17', '00000001017', 'Licenciatura em área específica', 'professor17@escola.com', '(12) 91000-0017', 'Rua dos Professores, 17'),
(18, 'Professor 18', '00000001018', 'Licenciatura em área específica', 'professor18@escola.com', '(12) 91000-0018', 'Rua dos Professores, 18'),
(19, 'Professor 19', '00000001019', 'Licenciatura em área específica', 'professor19@escola.com', '(12) 91000-0019', 'Rua dos Professores, 19'),
(20, 'Professor 20', '00000001020', 'Licenciatura em área específica', 'professor20@escola.com', '(12) 91000-0020', 'Rua dos Professores, 20');

-- --------------------------------------------------------

--
-- Estrutura para tabela `responsaveis`
--

CREATE TABLE `responsaveis` (
  `id_responsavel` int(11) NOT NULL,
  `nome` varchar(120) NOT NULL,
  `cpf` char(11) NOT NULL,
  `telefone` varchar(20) DEFAULT NULL,
  `email` varchar(150) DEFAULT NULL,
  `endereco` varchar(200) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `responsaveis`
--

INSERT INTO `responsaveis` (`id_responsavel`, `nome`, `cpf`, `telefone`, `email`, `endereco`) VALUES
(1, 'Responsável 1', '00000002001', '(12) 92000-0001', 'responsavel1@email.com', 'Rua dos Responsáveis, 1'),
(2, 'Responsável 2', '00000002002', '(12) 92000-0002', 'responsavel2@email.com', 'Rua dos Responsáveis, 2'),
(3, 'Responsável 3', '00000002003', '(12) 92000-0003', 'responsavel3@email.com', 'Rua dos Responsáveis, 3'),
(4, 'Responsável 4', '00000002004', '(12) 92000-0004', 'responsavel4@email.com', 'Rua dos Responsáveis, 4'),
(5, 'Responsável 5', '00000002005', '(12) 92000-0005', 'responsavel5@email.com', 'Rua dos Responsáveis, 5'),
(6, 'Responsável 6', '00000002006', '(12) 92000-0006', 'responsavel6@email.com', 'Rua dos Responsáveis, 6'),
(7, 'Responsável 7', '00000002007', '(12) 92000-0007', 'responsavel7@email.com', 'Rua dos Responsáveis, 7'),
(8, 'Responsável 8', '00000002008', '(12) 92000-0008', 'responsavel8@email.com', 'Rua dos Responsáveis, 8'),
(9, 'Responsável 9', '00000002009', '(12) 92000-0009', 'responsavel9@email.com', 'Rua dos Responsáveis, 9'),
(10, 'Responsável 10', '00000002010', '(12) 92000-0010', 'responsavel10@email.com', 'Rua dos Responsáveis, 10'),
(11, 'Responsável 11', '00000002011', '(12) 92000-0011', 'responsavel11@email.com', 'Rua dos Responsáveis, 11'),
(12, 'Responsável 12', '00000002012', '(12) 92000-0012', 'responsavel12@email.com', 'Rua dos Responsáveis, 12'),
(13, 'Responsável 13', '00000002013', '(12) 92000-0013', 'responsavel13@email.com', 'Rua dos Responsáveis, 13'),
(14, 'Responsável 14', '00000002014', '(12) 92000-0014', 'responsavel14@email.com', 'Rua dos Responsáveis, 14'),
(15, 'Responsável 15', '00000002015', '(12) 92000-0015', 'responsavel15@email.com', 'Rua dos Responsáveis, 15'),
(16, 'Responsável 16', '00000002016', '(12) 92000-0016', 'responsavel16@email.com', 'Rua dos Responsáveis, 16'),
(17, 'Responsável 17', '00000002017', '(12) 92000-0017', 'responsavel17@email.com', 'Rua dos Responsáveis, 17'),
(18, 'Responsável 18', '00000002018', '(12) 92000-0018', 'responsavel18@email.com', 'Rua dos Responsáveis, 18'),
(19, 'Responsável 19', '00000002019', '(12) 92000-0019', 'responsavel19@email.com', 'Rua dos Responsáveis, 19'),
(20, 'Responsável 20', '00000002020', '(12) 92000-0020', 'responsavel20@email.com', 'Rua dos Responsáveis, 20'),
(21, 'Responsável 21', '00000002021', '(12) 92000-0021', 'responsavel21@email.com', 'Rua dos Responsáveis, 21'),
(22, 'Responsável 22', '00000002022', '(12) 92000-0022', 'responsavel22@email.com', 'Rua dos Responsáveis, 22'),
(23, 'Responsável 23', '00000002023', '(12) 92000-0023', 'responsavel23@email.com', 'Rua dos Responsáveis, 23'),
(24, 'Responsável 24', '00000002024', '(12) 92000-0024', 'responsavel24@email.com', 'Rua dos Responsáveis, 24'),
(25, 'Responsável 25', '00000002025', '(12) 92000-0025', 'responsavel25@email.com', 'Rua dos Responsáveis, 25'),
(26, 'Responsável 26', '00000002026', '(12) 92000-0026', 'responsavel26@email.com', 'Rua dos Responsáveis, 26'),
(27, 'Responsável 27', '00000002027', '(12) 92000-0027', 'responsavel27@email.com', 'Rua dos Responsáveis, 27'),
(28, 'Responsável 28', '00000002028', '(12) 92000-0028', 'responsavel28@email.com', 'Rua dos Responsáveis, 28'),
(29, 'Responsável 29', '00000002029', '(12) 92000-0029', 'responsavel29@email.com', 'Rua dos Responsáveis, 29'),
(30, 'Responsável 30', '00000002030', '(12) 92000-0030', 'responsavel30@email.com', 'Rua dos Responsáveis, 30'),
(31, 'Responsável 31', '00000002031', '(12) 92000-0031', 'responsavel31@email.com', 'Rua dos Responsáveis, 31'),
(32, 'Responsável 32', '00000002032', '(12) 92000-0032', 'responsavel32@email.com', 'Rua dos Responsáveis, 32'),
(33, 'Responsável 33', '00000002033', '(12) 92000-0033', 'responsavel33@email.com', 'Rua dos Responsáveis, 33'),
(34, 'Responsável 34', '00000002034', '(12) 92000-0034', 'responsavel34@email.com', 'Rua dos Responsáveis, 34'),
(35, 'Responsável 35', '00000002035', '(12) 92000-0035', 'responsavel35@email.com', 'Rua dos Responsáveis, 35'),
(36, 'Responsável 36', '00000002036', '(12) 92000-0036', 'responsavel36@email.com', 'Rua dos Responsáveis, 36'),
(37, 'Responsável 37', '00000002037', '(12) 92000-0037', 'responsavel37@email.com', 'Rua dos Responsáveis, 37'),
(38, 'Responsável 38', '00000002038', '(12) 92000-0038', 'responsavel38@email.com', 'Rua dos Responsáveis, 38'),
(39, 'Responsável 39', '00000002039', '(12) 92000-0039', 'responsavel39@email.com', 'Rua dos Responsáveis, 39'),
(40, 'Responsável 40', '00000002040', '(12) 92000-0040', 'responsavel40@email.com', 'Rua dos Responsáveis, 40'),
(41, 'Responsável 41', '00000002041', '(12) 92000-0041', 'responsavel41@email.com', 'Rua dos Responsáveis, 41'),
(42, 'Responsável 42', '00000002042', '(12) 92000-0042', 'responsavel42@email.com', 'Rua dos Responsáveis, 42'),
(43, 'Responsável 43', '00000002043', '(12) 92000-0043', 'responsavel43@email.com', 'Rua dos Responsáveis, 43'),
(44, 'Responsável 44', '00000002044', '(12) 92000-0044', 'responsavel44@email.com', 'Rua dos Responsáveis, 44'),
(45, 'Responsável 45', '00000002045', '(12) 92000-0045', 'responsavel45@email.com', 'Rua dos Responsáveis, 45'),
(46, 'Responsável 46', '00000002046', '(12) 92000-0046', 'responsavel46@email.com', 'Rua dos Responsáveis, 46'),
(47, 'Responsável 47', '00000002047', '(12) 92000-0047', 'responsavel47@email.com', 'Rua dos Responsáveis, 47'),
(48, 'Responsável 48', '00000002048', '(12) 92000-0048', 'responsavel48@email.com', 'Rua dos Responsáveis, 48'),
(49, 'Responsável 49', '00000002049', '(12) 92000-0049', 'responsavel49@email.com', 'Rua dos Responsáveis, 49'),
(50, 'Responsável 50', '00000002050', '(12) 92000-0050', 'responsavel50@email.com', 'Rua dos Responsáveis, 50'),
(51, 'Responsável 51', '00000002051', '(12) 92000-0051', 'responsavel51@email.com', 'Rua dos Responsáveis, 51'),
(52, 'Responsável 52', '00000002052', '(12) 92000-0052', 'responsavel52@email.com', 'Rua dos Responsáveis, 52'),
(53, 'Responsável 53', '00000002053', '(12) 92000-0053', 'responsavel53@email.com', 'Rua dos Responsáveis, 53'),
(54, 'Responsável 54', '00000002054', '(12) 92000-0054', 'responsavel54@email.com', 'Rua dos Responsáveis, 54'),
(55, 'Responsável 55', '00000002055', '(12) 92000-0055', 'responsavel55@email.com', 'Rua dos Responsáveis, 55'),
(56, 'Responsável 56', '00000002056', '(12) 92000-0056', 'responsavel56@email.com', 'Rua dos Responsáveis, 56'),
(57, 'Responsável 57', '00000002057', '(12) 92000-0057', 'responsavel57@email.com', 'Rua dos Responsáveis, 57'),
(58, 'Responsável 58', '00000002058', '(12) 92000-0058', 'responsavel58@email.com', 'Rua dos Responsáveis, 58'),
(59, 'Responsável 59', '00000002059', '(12) 92000-0059', 'responsavel59@email.com', 'Rua dos Responsáveis, 59'),
(60, 'Responsável 60', '00000002060', '(12) 92000-0060', 'responsavel60@email.com', 'Rua dos Responsáveis, 60'),
(61, 'Responsável 61', '00000002061', '(12) 92000-0061', 'responsavel61@email.com', 'Rua dos Responsáveis, 61'),
(62, 'Responsável 62', '00000002062', '(12) 92000-0062', 'responsavel62@email.com', 'Rua dos Responsáveis, 62'),
(63, 'Responsável 63', '00000002063', '(12) 92000-0063', 'responsavel63@email.com', 'Rua dos Responsáveis, 63'),
(64, 'Responsável 64', '00000002064', '(12) 92000-0064', 'responsavel64@email.com', 'Rua dos Responsáveis, 64'),
(65, 'Responsável 65', '00000002065', '(12) 92000-0065', 'responsavel65@email.com', 'Rua dos Responsáveis, 65'),
(66, 'Responsável 66', '00000002066', '(12) 92000-0066', 'responsavel66@email.com', 'Rua dos Responsáveis, 66'),
(67, 'Responsável 67', '00000002067', '(12) 92000-0067', 'responsavel67@email.com', 'Rua dos Responsáveis, 67'),
(68, 'Responsável 68', '00000002068', '(12) 92000-0068', 'responsavel68@email.com', 'Rua dos Responsáveis, 68'),
(69, 'Responsável 69', '00000002069', '(12) 92000-0069', 'responsavel69@email.com', 'Rua dos Responsáveis, 69'),
(70, 'Responsável 70', '00000002070', '(12) 92000-0070', 'responsavel70@email.com', 'Rua dos Responsáveis, 70'),
(71, 'Responsável 71', '00000002071', '(12) 92000-0071', 'responsavel71@email.com', 'Rua dos Responsáveis, 71'),
(72, 'Responsável 72', '00000002072', '(12) 92000-0072', 'responsavel72@email.com', 'Rua dos Responsáveis, 72'),
(73, 'Responsável 73', '00000002073', '(12) 92000-0073', 'responsavel73@email.com', 'Rua dos Responsáveis, 73'),
(74, 'Responsável 74', '00000002074', '(12) 92000-0074', 'responsavel74@email.com', 'Rua dos Responsáveis, 74'),
(75, 'Responsável 75', '00000002075', '(12) 92000-0075', 'responsavel75@email.com', 'Rua dos Responsáveis, 75'),
(76, 'Responsável 76', '00000002076', '(12) 92000-0076', 'responsavel76@email.com', 'Rua dos Responsáveis, 76'),
(77, 'Responsável 77', '00000002077', '(12) 92000-0077', 'responsavel77@email.com', 'Rua dos Responsáveis, 77'),
(78, 'Responsável 78', '00000002078', '(12) 92000-0078', 'responsavel78@email.com', 'Rua dos Responsáveis, 78'),
(79, 'Responsável 79', '00000002079', '(12) 92000-0079', 'responsavel79@email.com', 'Rua dos Responsáveis, 79'),
(80, 'Responsável 80', '00000002080', '(12) 92000-0080', 'responsavel80@email.com', 'Rua dos Responsáveis, 80'),
(81, 'Responsável 81', '00000002081', '(12) 92000-0081', 'responsavel81@email.com', 'Rua dos Responsáveis, 81'),
(82, 'Responsável 82', '00000002082', '(12) 92000-0082', 'responsavel82@email.com', 'Rua dos Responsáveis, 82'),
(83, 'Responsável 83', '00000002083', '(12) 92000-0083', 'responsavel83@email.com', 'Rua dos Responsáveis, 83'),
(84, 'Responsável 84', '00000002084', '(12) 92000-0084', 'responsavel84@email.com', 'Rua dos Responsáveis, 84'),
(85, 'Responsável 85', '00000002085', '(12) 92000-0085', 'responsavel85@email.com', 'Rua dos Responsáveis, 85'),
(86, 'Responsável 86', '00000002086', '(12) 92000-0086', 'responsavel86@email.com', 'Rua dos Responsáveis, 86'),
(87, 'Responsável 87', '00000002087', '(12) 92000-0087', 'responsavel87@email.com', 'Rua dos Responsáveis, 87'),
(88, 'Responsável 88', '00000002088', '(12) 92000-0088', 'responsavel88@email.com', 'Rua dos Responsáveis, 88'),
(89, 'Responsável 89', '00000002089', '(12) 92000-0089', 'responsavel89@email.com', 'Rua dos Responsáveis, 89'),
(90, 'Responsável 90', '00000002090', '(12) 92000-0090', 'responsavel90@email.com', 'Rua dos Responsáveis, 90'),
(91, 'Responsável 91', '00000002091', '(12) 92000-0091', 'responsavel91@email.com', 'Rua dos Responsáveis, 91'),
(92, 'Responsável 92', '00000002092', '(12) 92000-0092', 'responsavel92@email.com', 'Rua dos Responsáveis, 92'),
(93, 'Responsável 93', '00000002093', '(12) 92000-0093', 'responsavel93@email.com', 'Rua dos Responsáveis, 93'),
(94, 'Responsável 94', '00000002094', '(12) 92000-0094', 'responsavel94@email.com', 'Rua dos Responsáveis, 94'),
(95, 'Responsável 95', '00000002095', '(12) 92000-0095', 'responsavel95@email.com', 'Rua dos Responsáveis, 95'),
(96, 'Responsável 96', '00000002096', '(12) 92000-0096', 'responsavel96@email.com', 'Rua dos Responsáveis, 96'),
(97, 'Responsável 97', '00000002097', '(12) 92000-0097', 'responsavel97@email.com', 'Rua dos Responsáveis, 97'),
(98, 'Responsável 98', '00000002098', '(12) 92000-0098', 'responsavel98@email.com', 'Rua dos Responsáveis, 98'),
(99, 'Responsável 99', '00000002099', '(12) 92000-0099', 'responsavel99@email.com', 'Rua dos Responsáveis, 99'),
(100, 'Responsável 100', '00000002100', '(12) 92000-0100', 'responsavel100@email.com', 'Rua dos Responsáveis, 100'),
(101, 'Responsável 101', '00000002101', '(12) 92000-0101', 'responsavel101@email.com', 'Rua dos Responsáveis, 101'),
(102, 'Responsável 102', '00000002102', '(12) 92000-0102', 'responsavel102@email.com', 'Rua dos Responsáveis, 102'),
(103, 'Responsável 103', '00000002103', '(12) 92000-0103', 'responsavel103@email.com', 'Rua dos Responsáveis, 103'),
(104, 'Responsável 104', '00000002104', '(12) 92000-0104', 'responsavel104@email.com', 'Rua dos Responsáveis, 104'),
(105, 'Responsável 105', '00000002105', '(12) 92000-0105', 'responsavel105@email.com', 'Rua dos Responsáveis, 105'),
(106, 'Responsável 106', '00000002106', '(12) 92000-0106', 'responsavel106@email.com', 'Rua dos Responsáveis, 106'),
(107, 'Responsável 107', '00000002107', '(12) 92000-0107', 'responsavel107@email.com', 'Rua dos Responsáveis, 107'),
(108, 'Responsável 108', '00000002108', '(12) 92000-0108', 'responsavel108@email.com', 'Rua dos Responsáveis, 108'),
(109, 'Responsável 109', '00000002109', '(12) 92000-0109', 'responsavel109@email.com', 'Rua dos Responsáveis, 109'),
(110, 'Responsável 110', '00000002110', '(12) 92000-0110', 'responsavel110@email.com', 'Rua dos Responsáveis, 110'),
(111, 'Responsável 111', '00000002111', '(12) 92000-0111', 'responsavel111@email.com', 'Rua dos Responsáveis, 111'),
(112, 'Responsável 112', '00000002112', '(12) 92000-0112', 'responsavel112@email.com', 'Rua dos Responsáveis, 112'),
(113, 'Responsável 113', '00000002113', '(12) 92000-0113', 'responsavel113@email.com', 'Rua dos Responsáveis, 113'),
(114, 'Responsável 114', '00000002114', '(12) 92000-0114', 'responsavel114@email.com', 'Rua dos Responsáveis, 114'),
(115, 'Responsável 115', '00000002115', '(12) 92000-0115', 'responsavel115@email.com', 'Rua dos Responsáveis, 115'),
(116, 'Responsável 116', '00000002116', '(12) 92000-0116', 'responsavel116@email.com', 'Rua dos Responsáveis, 116'),
(117, 'Responsável 117', '00000002117', '(12) 92000-0117', 'responsavel117@email.com', 'Rua dos Responsáveis, 117'),
(118, 'Responsável 118', '00000002118', '(12) 92000-0118', 'responsavel118@email.com', 'Rua dos Responsáveis, 118'),
(119, 'Responsável 119', '00000002119', '(12) 92000-0119', 'responsavel119@email.com', 'Rua dos Responsáveis, 119'),
(120, 'Responsável 120', '00000002120', '(12) 92000-0120', 'responsavel120@email.com', 'Rua dos Responsáveis, 120'),
(121, 'Responsável 121', '00000002121', '(12) 92000-0121', 'responsavel121@email.com', 'Rua dos Responsáveis, 121'),
(122, 'Responsável 122', '00000002122', '(12) 92000-0122', 'responsavel122@email.com', 'Rua dos Responsáveis, 122'),
(123, 'Responsável 123', '00000002123', '(12) 92000-0123', 'responsavel123@email.com', 'Rua dos Responsáveis, 123'),
(124, 'Responsável 124', '00000002124', '(12) 92000-0124', 'responsavel124@email.com', 'Rua dos Responsáveis, 124'),
(125, 'Responsável 125', '00000002125', '(12) 92000-0125', 'responsavel125@email.com', 'Rua dos Responsáveis, 125'),
(126, 'Responsável 126', '00000002126', '(12) 92000-0126', 'responsavel126@email.com', 'Rua dos Responsáveis, 126'),
(127, 'Responsável 127', '00000002127', '(12) 92000-0127', 'responsavel127@email.com', 'Rua dos Responsáveis, 127'),
(128, 'Responsável 128', '00000002128', '(12) 92000-0128', 'responsavel128@email.com', 'Rua dos Responsáveis, 128'),
(129, 'Responsável 129', '00000002129', '(12) 92000-0129', 'responsavel129@email.com', 'Rua dos Responsáveis, 129'),
(130, 'Responsável 130', '00000002130', '(12) 92000-0130', 'responsavel130@email.com', 'Rua dos Responsáveis, 130'),
(131, 'Responsável 131', '00000002131', '(12) 92000-0131', 'responsavel131@email.com', 'Rua dos Responsáveis, 131'),
(132, 'Responsável 132', '00000002132', '(12) 92000-0132', 'responsavel132@email.com', 'Rua dos Responsáveis, 132'),
(133, 'Responsável 133', '00000002133', '(12) 92000-0133', 'responsavel133@email.com', 'Rua dos Responsáveis, 133'),
(134, 'Responsável 134', '00000002134', '(12) 92000-0134', 'responsavel134@email.com', 'Rua dos Responsáveis, 134'),
(135, 'Responsável 135', '00000002135', '(12) 92000-0135', 'responsavel135@email.com', 'Rua dos Responsáveis, 135'),
(136, 'Responsável 136', '00000002136', '(12) 92000-0136', 'responsavel136@email.com', 'Rua dos Responsáveis, 136'),
(137, 'Responsável 137', '00000002137', '(12) 92000-0137', 'responsavel137@email.com', 'Rua dos Responsáveis, 137'),
(138, 'Responsável 138', '00000002138', '(12) 92000-0138', 'responsavel138@email.com', 'Rua dos Responsáveis, 138'),
(139, 'Responsável 139', '00000002139', '(12) 92000-0139', 'responsavel139@email.com', 'Rua dos Responsáveis, 139'),
(140, 'Responsável 140', '00000002140', '(12) 92000-0140', 'responsavel140@email.com', 'Rua dos Responsáveis, 140'),
(141, 'Responsável 141', '00000002141', '(12) 92000-0141', 'responsavel141@email.com', 'Rua dos Responsáveis, 141'),
(142, 'Responsável 142', '00000002142', '(12) 92000-0142', 'responsavel142@email.com', 'Rua dos Responsáveis, 142'),
(143, 'Responsável 143', '00000002143', '(12) 92000-0143', 'responsavel143@email.com', 'Rua dos Responsáveis, 143'),
(144, 'Responsável 144', '00000002144', '(12) 92000-0144', 'responsavel144@email.com', 'Rua dos Responsáveis, 144'),
(145, 'Responsável 145', '00000002145', '(12) 92000-0145', 'responsavel145@email.com', 'Rua dos Responsáveis, 145'),
(146, 'Responsável 146', '00000002146', '(12) 92000-0146', 'responsavel146@email.com', 'Rua dos Responsáveis, 146'),
(147, 'Responsável 147', '00000002147', '(12) 92000-0147', 'responsavel147@email.com', 'Rua dos Responsáveis, 147'),
(148, 'Responsável 148', '00000002148', '(12) 92000-0148', 'responsavel148@email.com', 'Rua dos Responsáveis, 148'),
(149, 'Responsável 149', '00000002149', '(12) 92000-0149', 'responsavel149@email.com', 'Rua dos Responsáveis, 149'),
(150, 'Responsável 150', '00000002150', '(12) 92000-0150', 'responsavel150@email.com', 'Rua dos Responsáveis, 150'),
(151, 'Responsável 151', '00000002151', '(12) 92000-0151', 'responsavel151@email.com', 'Rua dos Responsáveis, 151'),
(152, 'Responsável 152', '00000002152', '(12) 92000-0152', 'responsavel152@email.com', 'Rua dos Responsáveis, 152'),
(153, 'Responsável 153', '00000002153', '(12) 92000-0153', 'responsavel153@email.com', 'Rua dos Responsáveis, 153'),
(154, 'Responsável 154', '00000002154', '(12) 92000-0154', 'responsavel154@email.com', 'Rua dos Responsáveis, 154'),
(155, 'Responsável 155', '00000002155', '(12) 92000-0155', 'responsavel155@email.com', 'Rua dos Responsáveis, 155'),
(156, 'Responsável 156', '00000002156', '(12) 92000-0156', 'responsavel156@email.com', 'Rua dos Responsáveis, 156'),
(157, 'Responsável 157', '00000002157', '(12) 92000-0157', 'responsavel157@email.com', 'Rua dos Responsáveis, 157'),
(158, 'Responsável 158', '00000002158', '(12) 92000-0158', 'responsavel158@email.com', 'Rua dos Responsáveis, 158'),
(159, 'Responsável 159', '00000002159', '(12) 92000-0159', 'responsavel159@email.com', 'Rua dos Responsáveis, 159'),
(160, 'Responsável 160', '00000002160', '(12) 92000-0160', 'responsavel160@email.com', 'Rua dos Responsáveis, 160'),
(161, 'Responsável 161', '00000002161', '(12) 92000-0161', 'responsavel161@email.com', 'Rua dos Responsáveis, 161'),
(162, 'Responsável 162', '00000002162', '(12) 92000-0162', 'responsavel162@email.com', 'Rua dos Responsáveis, 162'),
(163, 'Responsável 163', '00000002163', '(12) 92000-0163', 'responsavel163@email.com', 'Rua dos Responsáveis, 163'),
(164, 'Responsável 164', '00000002164', '(12) 92000-0164', 'responsavel164@email.com', 'Rua dos Responsáveis, 164'),
(165, 'Responsável 165', '00000002165', '(12) 92000-0165', 'responsavel165@email.com', 'Rua dos Responsáveis, 165'),
(166, 'Responsável 166', '00000002166', '(12) 92000-0166', 'responsavel166@email.com', 'Rua dos Responsáveis, 166'),
(167, 'Responsável 167', '00000002167', '(12) 92000-0167', 'responsavel167@email.com', 'Rua dos Responsáveis, 167'),
(168, 'Responsável 168', '00000002168', '(12) 92000-0168', 'responsavel168@email.com', 'Rua dos Responsáveis, 168'),
(169, 'Responsável 169', '00000002169', '(12) 92000-0169', 'responsavel169@email.com', 'Rua dos Responsáveis, 169'),
(170, 'Responsável 170', '00000002170', '(12) 92000-0170', 'responsavel170@email.com', 'Rua dos Responsáveis, 170'),
(171, 'Responsável 171', '00000002171', '(12) 92000-0171', 'responsavel171@email.com', 'Rua dos Responsáveis, 171'),
(172, 'Responsável 172', '00000002172', '(12) 92000-0172', 'responsavel172@email.com', 'Rua dos Responsáveis, 172'),
(173, 'Responsável 173', '00000002173', '(12) 92000-0173', 'responsavel173@email.com', 'Rua dos Responsáveis, 173'),
(174, 'Responsável 174', '00000002174', '(12) 92000-0174', 'responsavel174@email.com', 'Rua dos Responsáveis, 174'),
(175, 'Responsável 175', '00000002175', '(12) 92000-0175', 'responsavel175@email.com', 'Rua dos Responsáveis, 175'),
(176, 'Responsável 176', '00000002176', '(12) 92000-0176', 'responsavel176@email.com', 'Rua dos Responsáveis, 176'),
(177, 'Responsável 177', '00000002177', '(12) 92000-0177', 'responsavel177@email.com', 'Rua dos Responsáveis, 177'),
(178, 'Responsável 178', '00000002178', '(12) 92000-0178', 'responsavel178@email.com', 'Rua dos Responsáveis, 178'),
(179, 'Responsável 179', '00000002179', '(12) 92000-0179', 'responsavel179@email.com', 'Rua dos Responsáveis, 179'),
(180, 'Responsável 180', '00000002180', '(12) 92000-0180', 'responsavel180@email.com', 'Rua dos Responsáveis, 180'),
(181, 'Responsável 181', '00000002181', '(12) 92000-0181', 'responsavel181@email.com', 'Rua dos Responsáveis, 181'),
(182, 'Responsável 182', '00000002182', '(12) 92000-0182', 'responsavel182@email.com', 'Rua dos Responsáveis, 182'),
(183, 'Responsável 183', '00000002183', '(12) 92000-0183', 'responsavel183@email.com', 'Rua dos Responsáveis, 183'),
(184, 'Responsável 184', '00000002184', '(12) 92000-0184', 'responsavel184@email.com', 'Rua dos Responsáveis, 184'),
(185, 'Responsável 185', '00000002185', '(12) 92000-0185', 'responsavel185@email.com', 'Rua dos Responsáveis, 185'),
(186, 'Responsável 186', '00000002186', '(12) 92000-0186', 'responsavel186@email.com', 'Rua dos Responsáveis, 186'),
(187, 'Responsável 187', '00000002187', '(12) 92000-0187', 'responsavel187@email.com', 'Rua dos Responsáveis, 187'),
(188, 'Responsável 188', '00000002188', '(12) 92000-0188', 'responsavel188@email.com', 'Rua dos Responsáveis, 188'),
(189, 'Responsável 189', '00000002189', '(12) 92000-0189', 'responsavel189@email.com', 'Rua dos Responsáveis, 189'),
(190, 'Responsável 190', '00000002190', '(12) 92000-0190', 'responsavel190@email.com', 'Rua dos Responsáveis, 190'),
(191, 'Responsável 191', '00000002191', '(12) 92000-0191', 'responsavel191@email.com', 'Rua dos Responsáveis, 191'),
(192, 'Responsável 192', '00000002192', '(12) 92000-0192', 'responsavel192@email.com', 'Rua dos Responsáveis, 192'),
(193, 'Responsável 193', '00000002193', '(12) 92000-0193', 'responsavel193@email.com', 'Rua dos Responsáveis, 193'),
(194, 'Responsável 194', '00000002194', '(12) 92000-0194', 'responsavel194@email.com', 'Rua dos Responsáveis, 194'),
(195, 'Responsável 195', '00000002195', '(12) 92000-0195', 'responsavel195@email.com', 'Rua dos Responsáveis, 195'),
(196, 'Responsável 196', '00000002196', '(12) 92000-0196', 'responsavel196@email.com', 'Rua dos Responsáveis, 196'),
(197, 'Responsável 197', '00000002197', '(12) 92000-0197', 'responsavel197@email.com', 'Rua dos Responsáveis, 197'),
(198, 'Responsável 198', '00000002198', '(12) 92000-0198', 'responsavel198@email.com', 'Rua dos Responsáveis, 198'),
(199, 'Responsável 199', '00000002199', '(12) 92000-0199', 'responsavel199@email.com', 'Rua dos Responsáveis, 199'),
(200, 'Responsável 200', '00000002200', '(12) 92000-0200', 'responsavel200@email.com', 'Rua dos Responsáveis, 200'),
(201, 'Responsável 201', '00000002201', '(12) 92000-0201', 'responsavel201@email.com', 'Rua dos Responsáveis, 201'),
(202, 'Responsável 202', '00000002202', '(12) 92000-0202', 'responsavel202@email.com', 'Rua dos Responsáveis, 202'),
(203, 'Responsável 203', '00000002203', '(12) 92000-0203', 'responsavel203@email.com', 'Rua dos Responsáveis, 203'),
(204, 'Responsável 204', '00000002204', '(12) 92000-0204', 'responsavel204@email.com', 'Rua dos Responsáveis, 204'),
(205, 'Responsável 205', '00000002205', '(12) 92000-0205', 'responsavel205@email.com', 'Rua dos Responsáveis, 205'),
(206, 'Responsável 206', '00000002206', '(12) 92000-0206', 'responsavel206@email.com', 'Rua dos Responsáveis, 206'),
(207, 'Responsável 207', '00000002207', '(12) 92000-0207', 'responsavel207@email.com', 'Rua dos Responsáveis, 207'),
(208, 'Responsável 208', '00000002208', '(12) 92000-0208', 'responsavel208@email.com', 'Rua dos Responsáveis, 208'),
(209, 'Responsável 209', '00000002209', '(12) 92000-0209', 'responsavel209@email.com', 'Rua dos Responsáveis, 209'),
(210, 'Responsável 210', '00000002210', '(12) 92000-0210', 'responsavel210@email.com', 'Rua dos Responsáveis, 210'),
(211, 'Responsável 211', '00000002211', '(12) 92000-0211', 'responsavel211@email.com', 'Rua dos Responsáveis, 211'),
(212, 'Responsável 212', '00000002212', '(12) 92000-0212', 'responsavel212@email.com', 'Rua dos Responsáveis, 212'),
(213, 'Responsável 213', '00000002213', '(12) 92000-0213', 'responsavel213@email.com', 'Rua dos Responsáveis, 213'),
(214, 'Responsável 214', '00000002214', '(12) 92000-0214', 'responsavel214@email.com', 'Rua dos Responsáveis, 214'),
(215, 'Responsável 215', '00000002215', '(12) 92000-0215', 'responsavel215@email.com', 'Rua dos Responsáveis, 215'),
(216, 'Responsável 216', '00000002216', '(12) 92000-0216', 'responsavel216@email.com', 'Rua dos Responsáveis, 216'),
(217, 'Responsável 217', '00000002217', '(12) 92000-0217', 'responsavel217@email.com', 'Rua dos Responsáveis, 217'),
(218, 'Responsável 218', '00000002218', '(12) 92000-0218', 'responsavel218@email.com', 'Rua dos Responsáveis, 218'),
(219, 'Responsável 219', '00000002219', '(12) 92000-0219', 'responsavel219@email.com', 'Rua dos Responsáveis, 219'),
(220, 'Responsável 220', '00000002220', '(12) 92000-0220', 'responsavel220@email.com', 'Rua dos Responsáveis, 220'),
(221, 'Responsável 221', '00000002221', '(12) 92000-0221', 'responsavel221@email.com', 'Rua dos Responsáveis, 221'),
(222, 'Responsável 222', '00000002222', '(12) 92000-0222', 'responsavel222@email.com', 'Rua dos Responsáveis, 222'),
(223, 'Responsável 223', '00000002223', '(12) 92000-0223', 'responsavel223@email.com', 'Rua dos Responsáveis, 223'),
(224, 'Responsável 224', '00000002224', '(12) 92000-0224', 'responsavel224@email.com', 'Rua dos Responsáveis, 224'),
(225, 'Responsável 225', '00000002225', '(12) 92000-0225', 'responsavel225@email.com', 'Rua dos Responsáveis, 225'),
(226, 'Responsável 226', '00000002226', '(12) 92000-0226', 'responsavel226@email.com', 'Rua dos Responsáveis, 226'),
(227, 'Responsável 227', '00000002227', '(12) 92000-0227', 'responsavel227@email.com', 'Rua dos Responsáveis, 227'),
(228, 'Responsável 228', '00000002228', '(12) 92000-0228', 'responsavel228@email.com', 'Rua dos Responsáveis, 228'),
(229, 'Responsável 229', '00000002229', '(12) 92000-0229', 'responsavel229@email.com', 'Rua dos Responsáveis, 229'),
(230, 'Responsável 230', '00000002230', '(12) 92000-0230', 'responsavel230@email.com', 'Rua dos Responsáveis, 230'),
(231, 'Responsável 231', '00000002231', '(12) 92000-0231', 'responsavel231@email.com', 'Rua dos Responsáveis, 231'),
(232, 'Responsável 232', '00000002232', '(12) 92000-0232', 'responsavel232@email.com', 'Rua dos Responsáveis, 232'),
(233, 'Responsável 233', '00000002233', '(12) 92000-0233', 'responsavel233@email.com', 'Rua dos Responsáveis, 233'),
(234, 'Responsável 234', '00000002234', '(12) 92000-0234', 'responsavel234@email.com', 'Rua dos Responsáveis, 234'),
(235, 'Responsável 235', '00000002235', '(12) 92000-0235', 'responsavel235@email.com', 'Rua dos Responsáveis, 235'),
(236, 'Responsável 236', '00000002236', '(12) 92000-0236', 'responsavel236@email.com', 'Rua dos Responsáveis, 236'),
(237, 'Responsável 237', '00000002237', '(12) 92000-0237', 'responsavel237@email.com', 'Rua dos Responsáveis, 237'),
(238, 'Responsável 238', '00000002238', '(12) 92000-0238', 'responsavel238@email.com', 'Rua dos Responsáveis, 238'),
(239, 'Responsável 239', '00000002239', '(12) 92000-0239', 'responsavel239@email.com', 'Rua dos Responsáveis, 239'),
(240, 'Responsável 240', '00000002240', '(12) 92000-0240', 'responsavel240@email.com', 'Rua dos Responsáveis, 240'),
(241, 'Responsável 241', '00000002241', '(12) 92000-0241', 'responsavel241@email.com', 'Rua dos Responsáveis, 241'),
(242, 'Responsável 242', '00000002242', '(12) 92000-0242', 'responsavel242@email.com', 'Rua dos Responsáveis, 242'),
(243, 'Responsável 243', '00000002243', '(12) 92000-0243', 'responsavel243@email.com', 'Rua dos Responsáveis, 243'),
(244, 'Responsável 244', '00000002244', '(12) 92000-0244', 'responsavel244@email.com', 'Rua dos Responsáveis, 244'),
(245, 'Responsável 245', '00000002245', '(12) 92000-0245', 'responsavel245@email.com', 'Rua dos Responsáveis, 245'),
(246, 'Responsável 246', '00000002246', '(12) 92000-0246', 'responsavel246@email.com', 'Rua dos Responsáveis, 246'),
(247, 'Responsável 247', '00000002247', '(12) 92000-0247', 'responsavel247@email.com', 'Rua dos Responsáveis, 247'),
(248, 'Responsável 248', '00000002248', '(12) 92000-0248', 'responsavel248@email.com', 'Rua dos Responsáveis, 248'),
(249, 'Responsável 249', '00000002249', '(12) 92000-0249', 'responsavel249@email.com', 'Rua dos Responsáveis, 249'),
(250, 'Responsável 250', '00000002250', '(12) 92000-0250', 'responsavel250@email.com', 'Rua dos Responsáveis, 250');

-- --------------------------------------------------------

--
-- Estrutura para tabela `turmas`
--

CREATE TABLE `turmas` (
  `id_turma` int(11) NOT NULL,
  `nome` varchar(80) NOT NULL,
  `ano_letivo` year(4) NOT NULL,
  `turno` enum('Manhã','Tarde','Noite') NOT NULL,
  `sala` varchar(20) NOT NULL,
  `id_curso` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Despejando dados para a tabela `turmas`
--

INSERT INTO `turmas` (`id_turma`, `nome`, `ano_letivo`, `turno`, `sala`, `id_curso`) VALUES
(1, 'Turma 1', '2026', 'Manhã', 'Sala 101', 1),
(2, 'Turma 2', '2026', 'Tarde', 'Sala 102', 2),
(3, 'Turma 3', '2026', 'Noite', 'Sala 103', 3),
(4, 'Turma 4', '2026', 'Tarde', 'Sala 104', 4),
(5, 'Turma 5', '2026', 'Manhã', 'Sala 105', 5);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_alunos_cursos`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_alunos_cursos` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`id_matricula` int(11)
,`situacao_matricula` enum('Ativa','Trancada','Concluída','Cancelada')
,`id_curso` int(11)
,`curso` varchar(120)
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_alunos_disciplinas_notas`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_alunos_disciplinas_notas` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`id_disciplina` int(11)
,`disciplina` varchar(120)
,`nota` decimal(5,2)
,`media_final` decimal(5,2)
,`situacao_final` enum('Aprovado','Reprovado','Em recuperação')
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_alunos_responsaveis`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_alunos_responsaveis` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`cpf_aluno` char(11)
,`id_responsavel` int(11)
,`responsavel` varchar(120)
,`cpf_responsavel` char(11)
,`telefone` varchar(20)
,`parentesco` varchar(50)
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_alunos_turmas_cursos`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_alunos_turmas_cursos` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`id_turma` int(11)
,`turma` varchar(80)
,`curso` varchar(120)
,`ano_letivo` year(4)
,`turno` enum('Manhã','Tarde','Noite')
,`sala` varchar(20)
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_alunos_turmas_disciplinas`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_alunos_turmas_disciplinas` (
`aluno` varchar(120)
,`turma` varchar(80)
,`curso` varchar(120)
,`disciplina` varchar(120)
,`professor` varchar(120)
,`ano_letivo` year(4)
,`turno` enum('Manhã','Tarde','Noite')
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_desempenho_academico`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_desempenho_academico` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`curso` varchar(120)
,`disciplina` varchar(120)
,`media_avaliacoes` decimal(9,6)
,`media_final` decimal(5,2)
,`frequencia` decimal(5,2)
,`situacao_final` enum('Aprovado','Reprovado','Em recuperação')
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_disciplinas_professores`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_disciplinas_professores` (
`id_disciplina` int(11)
,`disciplina` varchar(120)
,`carga_horaria` int(11)
,`id_professor` int(11)
,`professor` varchar(120)
,`formacao` varchar(120)
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_disciplinas_professores_cursos`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_disciplinas_professores_cursos` (
`curso` varchar(120)
,`id_disciplina` int(11)
,`disciplina` varchar(120)
,`carga_horaria` int(11)
,`id_professor` int(11)
,`professor` varchar(120)
,`formacao` varchar(120)
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_relatorio_academico_completo`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_relatorio_academico_completo` (
`id_aluno` int(11)
,`aluno` varchar(120)
,`curso` varchar(120)
,`turma` varchar(80)
,`disciplina` varchar(120)
,`professor` varchar(120)
,`nota` decimal(5,2)
,`media_final` decimal(5,2)
,`frequencia` decimal(5,2)
,`situacao_final` enum('Aprovado','Reprovado','Em recuperação')
);

-- --------------------------------------------------------

--
-- Estrutura stand-in para view `vw_status_matriculas`
-- (Veja abaixo para a visão atual)
--
CREATE TABLE `vw_status_matriculas` (
`aluno` varchar(120)
,`curso` varchar(120)
,`turma` varchar(80)
,`data_matricula` date
,`situacao` enum('Ativa','Trancada','Concluída','Cancelada')
,`ano_letivo` year(4)
,`turno` enum('Manhã','Tarde','Noite')
);

-- --------------------------------------------------------

--
-- Estrutura para view `vw_alunos_cursos`
--
DROP TABLE IF EXISTS `vw_alunos_cursos`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_alunos_cursos`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `m`.`id_matricula` AS `id_matricula`, `m`.`situacao` AS `situacao_matricula`, `c`.`id_curso` AS `id_curso`, `c`.`nome` AS `curso` FROM (((`alunos` `a` join `matriculas` `m` on(`m`.`id_aluno` = `a`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_alunos_disciplinas_notas`
--
DROP TABLE IF EXISTS `vw_alunos_disciplinas_notas`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_alunos_disciplinas_notas`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `d`.`id_disciplina` AS `id_disciplina`, `d`.`nome` AS `disciplina`, `av`.`nota` AS `nota`, `b`.`media_final` AS `media_final`, `b`.`situacao_final` AS `situacao_final` FROM (((`avaliacoes` `av` join `alunos` `a` on(`a`.`id_aluno` = `av`.`id_aluno`)) join `disciplinas` `d` on(`d`.`id_disciplina` = `av`.`id_disciplina`)) left join `boletins` `b` on(`b`.`id_aluno` = `a`.`id_aluno`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_alunos_responsaveis`
--
DROP TABLE IF EXISTS `vw_alunos_responsaveis`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_alunos_responsaveis`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `a`.`cpf` AS `cpf_aluno`, `r`.`id_responsavel` AS `id_responsavel`, `r`.`nome` AS `responsavel`, `r`.`cpf` AS `cpf_responsavel`, `r`.`telefone` AS `telefone`, `ar`.`parentesco` AS `parentesco` FROM ((`aluno_responsavel` `ar` join `alunos` `a` on(`a`.`id_aluno` = `ar`.`id_aluno`)) join `responsaveis` `r` on(`r`.`id_responsavel` = `ar`.`id_responsavel`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_alunos_turmas_cursos`
--
DROP TABLE IF EXISTS `vw_alunos_turmas_cursos`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_alunos_turmas_cursos`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `t`.`id_turma` AS `id_turma`, `t`.`nome` AS `turma`, `c`.`nome` AS `curso`, `t`.`ano_letivo` AS `ano_letivo`, `t`.`turno` AS `turno`, `t`.`sala` AS `sala` FROM (((`alunos` `a` join `matriculas` `m` on(`m`.`id_aluno` = `a`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_alunos_turmas_disciplinas`
--
DROP TABLE IF EXISTS `vw_alunos_turmas_disciplinas`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_alunos_turmas_disciplinas`  AS SELECT `a`.`nome` AS `aluno`, `t`.`nome` AS `turma`, `c`.`nome` AS `curso`, `d`.`nome` AS `disciplina`, `p`.`nome` AS `professor`, `t`.`ano_letivo` AS `ano_letivo`, `t`.`turno` AS `turno` FROM (((((`alunos` `a` join `matriculas` `m` on(`m`.`id_aluno` = `a`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) join `disciplinas` `d` on(`d`.`id_curso` = `c`.`id_curso`)) join `professores` `p` on(`p`.`id_professor` = `d`.`id_professor`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_desempenho_academico`
--
DROP TABLE IF EXISTS `vw_desempenho_academico`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_desempenho_academico`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `c`.`nome` AS `curso`, `d`.`nome` AS `disciplina`, avg(`av`.`nota`) AS `media_avaliacoes`, `b`.`media_final` AS `media_final`, `b`.`frequencia` AS `frequencia`, `b`.`situacao_final` AS `situacao_final` FROM ((((((`avaliacoes` `av` join `alunos` `a` on(`a`.`id_aluno` = `av`.`id_aluno`)) join `disciplinas` `d` on(`d`.`id_disciplina` = `av`.`id_disciplina`)) join `matriculas` `m` on(`m`.`id_aluno` = `a`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) left join `boletins` `b` on(`b`.`id_aluno` = `a`.`id_aluno`)) GROUP BY `a`.`id_aluno`, `a`.`nome`, `c`.`nome`, `d`.`nome`, `b`.`media_final`, `b`.`frequencia`, `b`.`situacao_final` ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_disciplinas_professores`
--
DROP TABLE IF EXISTS `vw_disciplinas_professores`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_disciplinas_professores`  AS SELECT `d`.`id_disciplina` AS `id_disciplina`, `d`.`nome` AS `disciplina`, `d`.`carga_horaria` AS `carga_horaria`, `p`.`id_professor` AS `id_professor`, `p`.`nome` AS `professor`, `p`.`formacao` AS `formacao` FROM (`disciplinas` `d` join `professores` `p` on(`p`.`id_professor` = `d`.`id_professor`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_disciplinas_professores_cursos`
--
DROP TABLE IF EXISTS `vw_disciplinas_professores_cursos`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_disciplinas_professores_cursos`  AS SELECT `c`.`nome` AS `curso`, `d`.`id_disciplina` AS `id_disciplina`, `d`.`nome` AS `disciplina`, `d`.`carga_horaria` AS `carga_horaria`, `p`.`id_professor` AS `id_professor`, `p`.`nome` AS `professor`, `p`.`formacao` AS `formacao` FROM ((`disciplinas` `d` join `cursos` `c` on(`c`.`id_curso` = `d`.`id_curso`)) join `professores` `p` on(`p`.`id_professor` = `d`.`id_professor`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_relatorio_academico_completo`
--
DROP TABLE IF EXISTS `vw_relatorio_academico_completo`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_relatorio_academico_completo`  AS SELECT `a`.`id_aluno` AS `id_aluno`, `a`.`nome` AS `aluno`, `c`.`nome` AS `curso`, `t`.`nome` AS `turma`, `d`.`nome` AS `disciplina`, `p`.`nome` AS `professor`, `av`.`nota` AS `nota`, `b`.`media_final` AS `media_final`, `b`.`frequencia` AS `frequencia`, `b`.`situacao_final` AS `situacao_final` FROM (((((((`alunos` `a` join `matriculas` `m` on(`m`.`id_aluno` = `a`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) join `avaliacoes` `av` on(`av`.`id_aluno` = `a`.`id_aluno`)) join `disciplinas` `d` on(`d`.`id_disciplina` = `av`.`id_disciplina`)) join `professores` `p` on(`p`.`id_professor` = `d`.`id_professor`)) left join `boletins` `b` on(`b`.`id_aluno` = `a`.`id_aluno`)) ;

-- --------------------------------------------------------

--
-- Estrutura para view `vw_status_matriculas`
--
DROP TABLE IF EXISTS `vw_status_matriculas`;

CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `vw_status_matriculas`  AS SELECT `a`.`nome` AS `aluno`, `c`.`nome` AS `curso`, `t`.`nome` AS `turma`, `m`.`data_matricula` AS `data_matricula`, `m`.`situacao` AS `situacao`, `t`.`ano_letivo` AS `ano_letivo`, `t`.`turno` AS `turno` FROM (((`matriculas` `m` join `alunos` `a` on(`a`.`id_aluno` = `m`.`id_aluno`)) join `turmas` `t` on(`t`.`id_turma` = `m`.`id_turma`)) join `cursos` `c` on(`c`.`id_curso` = `t`.`id_curso`)) ;

--
-- Índices para tabelas despejadas
--

--
-- Índices de tabela `alunos`
--
ALTER TABLE `alunos`
  ADD PRIMARY KEY (`id_aluno`),
  ADD UNIQUE KEY `cpf` (`cpf`);

--
-- Índices de tabela `aluno_responsavel`
--
ALTER TABLE `aluno_responsavel`
  ADD PRIMARY KEY (`id_aluno_responsavel`),
  ADD KEY `fk_ar_aluno` (`id_aluno`),
  ADD KEY `fk_ar_responsavel` (`id_responsavel`);

--
-- Índices de tabela `avaliacoes`
--
ALTER TABLE `avaliacoes`
  ADD PRIMARY KEY (`id_avaliacao`),
  ADD KEY `fk_avaliacao_aluno` (`id_aluno`),
  ADD KEY `fk_avaliacao_disciplina` (`id_disciplina`);

--
-- Índices de tabela `boletins`
--
ALTER TABLE `boletins`
  ADD PRIMARY KEY (`id_boletim`),
  ADD KEY `fk_boletim_aluno` (`id_aluno`);

--
-- Índices de tabela `coordenadores`
--
ALTER TABLE `coordenadores`
  ADD PRIMARY KEY (`id_coordenador`),
  ADD UNIQUE KEY `cpf` (`cpf`);

--
-- Índices de tabela `cursos`
--
ALTER TABLE `cursos`
  ADD PRIMARY KEY (`id_curso`),
  ADD KEY `fk_curso_coordenador` (`id_coordenador`);

--
-- Índices de tabela `disciplinas`
--
ALTER TABLE `disciplinas`
  ADD PRIMARY KEY (`id_disciplina`),
  ADD KEY `fk_disciplina_curso` (`id_curso`),
  ADD KEY `fk_disciplina_professor` (`id_professor`);

--
-- Índices de tabela `frequencias`
--
ALTER TABLE `frequencias`
  ADD PRIMARY KEY (`id_frequencia`),
  ADD KEY `fk_frequencia_aluno` (`id_aluno`),
  ADD KEY `fk_frequencia_turma` (`id_turma`);

--
-- Índices de tabela `matriculas`
--
ALTER TABLE `matriculas`
  ADD PRIMARY KEY (`id_matricula`),
  ADD KEY `fk_matricula_aluno` (`id_aluno`),
  ADD KEY `fk_matricula_turma` (`id_turma`);

--
-- Índices de tabela `professores`
--
ALTER TABLE `professores`
  ADD PRIMARY KEY (`id_professor`),
  ADD UNIQUE KEY `cpf` (`cpf`);

--
-- Índices de tabela `responsaveis`
--
ALTER TABLE `responsaveis`
  ADD PRIMARY KEY (`id_responsavel`),
  ADD UNIQUE KEY `cpf` (`cpf`);

--
-- Índices de tabela `turmas`
--
ALTER TABLE `turmas`
  ADD PRIMARY KEY (`id_turma`),
  ADD KEY `fk_turma_curso` (`id_curso`);

--
-- AUTO_INCREMENT para tabelas despejadas
--

--
-- AUTO_INCREMENT de tabela `alunos`
--
ALTER TABLE `alunos`
  MODIFY `id_aluno` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `aluno_responsavel`
--
ALTER TABLE `aluno_responsavel`
  MODIFY `id_aluno_responsavel` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `avaliacoes`
--
ALTER TABLE `avaliacoes`
  MODIFY `id_avaliacao` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1001;

--
-- AUTO_INCREMENT de tabela `boletins`
--
ALTER TABLE `boletins`
  MODIFY `id_boletim` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `coordenadores`
--
ALTER TABLE `coordenadores`
  MODIFY `id_coordenador` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT de tabela `cursos`
--
ALTER TABLE `cursos`
  MODIFY `id_curso` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT de tabela `disciplinas`
--
ALTER TABLE `disciplinas`
  MODIFY `id_disciplina` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT de tabela `frequencias`
--
ALTER TABLE `frequencias`
  MODIFY `id_frequencia` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `matriculas`
--
ALTER TABLE `matriculas`
  MODIFY `id_matricula` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `professores`
--
ALTER TABLE `professores`
  MODIFY `id_professor` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT de tabela `responsaveis`
--
ALTER TABLE `responsaveis`
  MODIFY `id_responsavel` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=251;

--
-- AUTO_INCREMENT de tabela `turmas`
--
ALTER TABLE `turmas`
  MODIFY `id_turma` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- Restrições para tabelas despejadas
--

--
-- Restrições para tabelas `aluno_responsavel`
--
ALTER TABLE `aluno_responsavel`
  ADD CONSTRAINT `fk_ar_aluno` FOREIGN KEY (`id_aluno`) REFERENCES `alunos` (`id_aluno`),
  ADD CONSTRAINT `fk_ar_responsavel` FOREIGN KEY (`id_responsavel`) REFERENCES `responsaveis` (`id_responsavel`);

--
-- Restrições para tabelas `avaliacoes`
--
ALTER TABLE `avaliacoes`
  ADD CONSTRAINT `fk_avaliacao_aluno` FOREIGN KEY (`id_aluno`) REFERENCES `alunos` (`id_aluno`),
  ADD CONSTRAINT `fk_avaliacao_disciplina` FOREIGN KEY (`id_disciplina`) REFERENCES `disciplinas` (`id_disciplina`);

--
-- Restrições para tabelas `boletins`
--
ALTER TABLE `boletins`
  ADD CONSTRAINT `fk_boletim_aluno` FOREIGN KEY (`id_aluno`) REFERENCES `alunos` (`id_aluno`);

--
-- Restrições para tabelas `cursos`
--
ALTER TABLE `cursos`
  ADD CONSTRAINT `fk_curso_coordenador` FOREIGN KEY (`id_coordenador`) REFERENCES `coordenadores` (`id_coordenador`);

--
-- Restrições para tabelas `disciplinas`
--
ALTER TABLE `disciplinas`
  ADD CONSTRAINT `fk_disciplina_curso` FOREIGN KEY (`id_curso`) REFERENCES `cursos` (`id_curso`),
  ADD CONSTRAINT `fk_disciplina_professor` FOREIGN KEY (`id_professor`) REFERENCES `professores` (`id_professor`);

--
-- Restrições para tabelas `frequencias`
--
ALTER TABLE `frequencias`
  ADD CONSTRAINT `fk_frequencia_aluno` FOREIGN KEY (`id_aluno`) REFERENCES `alunos` (`id_aluno`),
  ADD CONSTRAINT `fk_frequencia_turma` FOREIGN KEY (`id_turma`) REFERENCES `turmas` (`id_turma`);

--
-- Restrições para tabelas `matriculas`
--
ALTER TABLE `matriculas`
  ADD CONSTRAINT `fk_matricula_aluno` FOREIGN KEY (`id_aluno`) REFERENCES `alunos` (`id_aluno`),
  ADD CONSTRAINT `fk_matricula_turma` FOREIGN KEY (`id_turma`) REFERENCES `turmas` (`id_turma`);

--
-- Restrições para tabelas `turmas`
--
ALTER TABLE `turmas`
  ADD CONSTRAINT `fk_turma_curso` FOREIGN KEY (`id_curso`) REFERENCES `cursos` (`id_curso`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
